TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_spgss1__include
#define ti_devices_msp_peripherals_hw_spgss1__include

/* This preliminary header file does not have a version number */
/* Filename: hw_spgss1.h */
/* MMR revised: 2025-04-09 14:12:34 */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/m33c1 */
/* MMR revision: f4602b816b1643a266cc7aae6be755d35f394359 */
/* Generator revision: ee5e56ed8e50e22306abbffa1ce64d23abbf32b9
   (MInT: 1818019a64e181dbbfd48fdc69fea15367af4c13) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* SPGSS1 Registers
******************************************************************************/
#define M33C1SPGSS1_SPGSS_LMGMT_DFT_ATRT_OFS     ((uint32_t)0x000A0C00U)
#define M33C1SPGSS1_I2C_PAIR_OFS                 ((uint32_t)0x000A01C0U)
#define M33C1SPGSS1_UNICOMM_LPBK_OFS             ((uint32_t)0x000A0120U)
#define M33C1SPGSS1_SPGSS_IPSPECIFIC_OFS         ((uint32_t)0x000A0100U)
#define M33C1SPGSS1_UC5_IPSPECIFIC_OFS           ((uint32_t)0x0008B100U)
#define M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_OFS      ((uint32_t)0x0008A800U)
#define M33C1SPGSS1_EXT_GPRCM_UC5_OFS            ((uint32_t)0x0008A800U)
#define M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_OFS      ((uint32_t)0x00088800U)
#define M33C1SPGSS1_EXT_GPRCM_UC4_OFS            ((uint32_t)0x00088800U)
#define M33C1SPGSS1_UC3_IPSPECIFIC_OFS           ((uint32_t)0x00087100U)
#define M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_OFS      ((uint32_t)0x00086800U)
#define M33C1SPGSS1_EXT_GPRCM_UC3_OFS            ((uint32_t)0x00086800U)
#define M33C1SPGSS1_UC2_IPSPECIFIC_OFS           ((uint32_t)0x00085100U)
#define M33C1SPGSS1_EXT_GPRCM_UC2_GPRCM_OFS      ((uint32_t)0x00084800U)
#define M33C1SPGSS1_EXT_GPRCM_UC2_OFS            ((uint32_t)0x00084800U)
#define M33C1SPGSS1_EXT_GPRCM_UC0_GPRCM_OFS      ((uint32_t)0x00080800U)
#define M33C1SPGSS1_EXT_GPRCM_UC0_OFS            ((uint32_t)0x00080800U)
#define M33C1SPGSS1_UC5_SPI_LMGMT_DFT_ATRT_OFS   ((uint32_t)0x0006BE00U)
#define M33C1SPGSS1_UC5_SPI_IPSPECIFIC_OFS       ((uint32_t)0x0006B100U)
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_OFS ((uint32_t)0x0006B080U)
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_OFS ((uint32_t)0x0006B050U)
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x0006B020U)
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_OFS       ((uint32_t)0x0006B000U)
#define M33C1SPGSS1_UC0_SPI_LMGMT_DFT_ATRT_OFS   ((uint32_t)0x00061E00U)
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_OFS       ((uint32_t)0x00061100U)
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_OFS ((uint32_t)0x00061080U)
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_OFS ((uint32_t)0x00061050U)
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x00061020U)
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_OFS       ((uint32_t)0x00061000U)
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x0004BE00U)
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_OFS      ((uint32_t)0x0004B100U)
#define M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG0_OFS ((uint32_t)0x0004B080U)
#define M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG1_OFS ((uint32_t)0x0004B050U)
#define M33C1SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x0004B020U)
#define M33C1SPGSS1_UC5_I2CT_IPSTANDARD_OFS      ((uint32_t)0x0004B000U)
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x00047E00U)
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OFS      ((uint32_t)0x00047100U)
#define M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG0_OFS ((uint32_t)0x00047080U)
#define M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG1_OFS ((uint32_t)0x00047050U)
#define M33C1SPGSS1_UC3_I2CT_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x00047020U)
#define M33C1SPGSS1_UC3_I2CT_IPSTANDARD_OFS      ((uint32_t)0x00047000U)
#define M33C1SPGSS1_UC2_I2CT_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x00045E00U)
#define M33C1SPGSS1_UC2_I2CT_IPSPECIFIC_OFS      ((uint32_t)0x00045100U)
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_DMA_TRIG0_OFS ((uint32_t)0x00045080U)
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_DMA_TRIG1_OFS ((uint32_t)0x00045050U)
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x00045020U)
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_OFS      ((uint32_t)0x00045000U)
#define M33C1SPGSS1_UC5_I2CC_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x0002BE00U)
#define M33C1SPGSS1_UC5_I2CC_IPSPECIFIC_OFS      ((uint32_t)0x0002B100U)
#define M33C1SPGSS1_UC5_I2CC_IPSTANDARD_DMA_TRIG0_OFS ((uint32_t)0x0002B080U)
#define M33C1SPGSS1_UC5_I2CC_IPSTANDARD_DMA_TRIG1_OFS ((uint32_t)0x0002B050U)
#define M33C1SPGSS1_UC5_I2CC_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x0002B020U)
#define M33C1SPGSS1_UC5_I2CC_IPSTANDARD_OFS      ((uint32_t)0x0002B000U)
#define M33C1SPGSS1_UC3_I2CC_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x00027E00U)
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_OFS      ((uint32_t)0x00027100U)
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_DMA_TRIG0_OFS ((uint32_t)0x00027080U)
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_DMA_TRIG1_OFS ((uint32_t)0x00027050U)
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x00027020U)
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_OFS      ((uint32_t)0x00027000U)
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x00025E00U)
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_OFS      ((uint32_t)0x00025100U)
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_DMA_TRIG0_OFS ((uint32_t)0x00025080U)
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_DMA_TRIG1_OFS ((uint32_t)0x00025050U)
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x00025020U)
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_OFS      ((uint32_t)0x00025000U)
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x0000BE00U)
#define M33C1SPGSS1_UC5_UART_IPSPECIFIC_OFS      ((uint32_t)0x0000B100U)
#define M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_TX_OFS ((uint32_t)0x0000B080U)
#define M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_RX_OFS ((uint32_t)0x0000B050U)
#define M33C1SPGSS1_UC5_UART_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x0000B020U)
#define M33C1SPGSS1_UC5_UART_IPSTANDARD_OFS      ((uint32_t)0x0000B000U)
#define M33C1SPGSS1_UC4_UART_LMGMT_DFT_ATRT_OFS  ((uint32_t)0x00009E00U)
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_OFS      ((uint32_t)0x00009100U)
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_TX_OFS ((uint32_t)0x00009080U)
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_RX_OFS ((uint32_t)0x00009050U)
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_OFS ((uint32_t)0x00009020U)
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_OFS      ((uint32_t)0x00009000U)
#define M33C1SPGSS1_FUPDATE_OFS                  ((uint32_t)0x00000204U)
#define M33C1SPGSS1_PINCM_OFS                    ((uint32_t)0x00000004U)


/** @addtogroup M33C1SPGSS1_SPGSS_LMGMT_DFT_ATRT
  @{
*/

