TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/** @addtogroup M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00061088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00061090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00061098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000610A0) Interrupt set */
} M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00061058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00061060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00061068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00061070) Interrupt set */
} M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00061020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00061028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00061030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00061038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00061040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00061048) Interrupt clear */
} M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS1_UC0_SPI_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00061000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00061008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00061018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00061020) */
       uint32_t RESERVED3;
  M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00061050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00061080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000610E4) Interrupt control register */
} M33C1SPGSS1_UC0_SPI_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC0_SPI_IPSTANDARD */

/** @addtogroup M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x0004BE00) Test 0 register */
} M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS1_UC5_I2CT_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x0004B100) I2C Target Control Register */
  __IO uint32_t ACKCTL;                            /* !< (@ 0x0004B104) I2C Target ACK Control */
  __I  uint32_t SR;                                /* !< (@ 0x0004B108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0004B10C) Interrupt FIFO Level Select Register */
       uint32_t RESERVED0[2];
  __IO uint32_t GFCTL;                             /* !< (@ 0x0004B118) I2C Glitch Filter Control */
       uint32_t RESERVED1;
  __O  uint32_t TTXDATA;                           /* !< (@ 0x0004B120) I2C TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x0004B124) I2C RXData */
       uint32_t RESERVED2[9];
  __IO uint32_t OAR;                               /* !< (@ 0x0004B14C) I2C Own Address */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x0004B150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x0004B154) I2C Timeout Count Control Register */
} M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_I2CT_IPSPECIFIC */

/** @addtogroup M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x0004B088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x0004B090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x0004B098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x0004B0A0) Interrupt set */
} M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG0_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG0 */

/** @addtogroup M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x0004B058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x0004B060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x0004B068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x0004B070) Interrupt set */
} M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG1_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG1 */

