TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/** @addtogroup M33C1SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x0004B020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x0004B028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x0004B030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x0004B038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x0004B040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x0004B048) Interrupt clear */
} M33C1SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS1_UC5_I2CT_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x0004B000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x0004B008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x0004B018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x0004B020) */
       uint32_t RESERVED3;
  M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x0004B050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS1_UC5_I2CT_IPSTANDARD_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x0004B080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x0004B0E4) Interrupt control register */
} M33C1SPGSS1_UC5_I2CT_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_I2CT_IPSTANDARD */

/** @addtogroup M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00047E00) Test 0 register */
  __IO uint32_t TEST1;                             /* !< (@ 0x00047E04) Test 0 register */
} M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS1_UC3_I2CT_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00047100) I2C Target Control Register */
  __IO uint32_t ACKCTL;                            /* !< (@ 0x00047104) I2C Target ACK Control */
  __I  uint32_t SR;                                /* !< (@ 0x00047108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0004710C) Interrupt FIFO Level Select Register */
       uint32_t RESERVED0[2];
  __IO uint32_t GFCTL;                             /* !< (@ 0x00047118) I2C Glitch Filter Control */
       uint32_t RESERVED1;
  __O  uint32_t TTXDATA;                           /* !< (@ 0x00047120) I2C TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00047124) I2C RXData */
  __I  uint32_t PECSR;                             /* !< (@ 0x00047128) PEC status register */
       uint32_t RESERVED2[7];
  __IO uint32_t OAR2;                              /* !< (@ 0x00047148) Own Address 2 */
  __IO uint32_t OAR;                               /* !< (@ 0x0004714C) I2C Own Address */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00047150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00047154) I2C Timeout Count Control Register */
  __IO uint32_t PECCTL;                            /* !< (@ 0x00047158) I2C PEC control register */
} M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC3_I2CT_IPSPECIFIC */

/** @addtogroup M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00047088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00047090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00047098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000470A0) Interrupt set */
} M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG0_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG0 */

/** @addtogroup M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00047058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00047060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00047068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00047070) Interrupt set */
} M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG1_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC3_I2CT_IPSTANDARD_DMA_TRIG1 */

/** @addtogroup M33C1SPGSS1_UC3_I2CT_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00047020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00047028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00047030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00047038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00047040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00047048) Interrupt clear */
} M33C1SPGSS1_UC3_I2CT_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC3_I2CT_IPSTANDARD_CPU_INT */

