TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00025020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00025028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00025030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00025038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00025040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00025048) Interrupt clear */
} M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS1_UC2_I2CC_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00025000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00025008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00025018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00025020) */
       uint32_t RESERVED3;
  M33C1SPGSS1_UC2_I2CC_IPSTANDARD_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00025050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS1_UC2_I2CC_IPSTANDARD_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00025080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000250E4) Interrupt control register */
} M33C1SPGSS1_UC2_I2CC_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC2_I2CC_IPSTANDARD */

/** @addtogroup M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x0000BE00) Test 0 register */
} M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS1_UC5_UART_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x0000B100) UART Control Register 0 */
  __IO uint32_t LCRH;                              /* !< (@ 0x0000B104) UART Line Control Register */
  __I  uint32_t STAT;                              /* !< (@ 0x0000B108) UART Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000B10C) UART Interrupt FIFO Level Select Register */
  __IO uint32_t IBRD;                              /* !< (@ 0x0000B110) UART Integer Baud-Rate Divisor Register */
  __IO uint32_t FBRD;                              /* !< (@ 0x0000B114) UART Fractional Baud-Rate Divisor Register */
       uint32_t RESERVED0[2];
  __O  uint32_t TXDATA;                            /* !< (@ 0x0000B120) UART Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x0000B124) UART Receive Data Register */
       uint32_t RESERVED1[8];
  __IO uint32_t AMASK;                             /* !< (@ 0x0000B148) Self Address Mask Register */
  __IO uint32_t ADDR;                              /* !< (@ 0x0000B14C) Self Address Register */
} M33C1SPGSS1_UC5_UART_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_UART_IPSPECIFIC */

/** @addtogroup M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x0000B088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x0000B090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x0000B098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x0000B0A0) Interrupt set */
} M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x0000B058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x0000B060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x0000B068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x0000B070) Interrupt set */
} M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS1_UC5_UART_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x0000B020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x0000B028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x0000B030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x0000B038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x0000B040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x0000B048) Interrupt clear */
} M33C1SPGSS1_UC5_UART_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC5_UART_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS1_UC5_UART_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x0000B000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x0000B008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x0000B018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS1_UC5_UART_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x0000B020) */
       uint32_t RESERVED3;
  M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x0000B050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS1_UC5_UART_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x0000B080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x0000B0E4) Interrupt control register */
} M33C1SPGSS1_UC5_UART_IPSTANDARD_Regs;

