TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/*@}*/ /* end of group M33C1SPGSS1_UC5_UART_IPSTANDARD */

/** @addtogroup M33C1SPGSS1_UC4_UART_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00009E00) Test 0 register */
} M33C1SPGSS1_UC4_UART_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC4_UART_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS1_UC4_UART_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00009100) UART Control Register 0 */
  __IO uint32_t LCRH;                              /* !< (@ 0x00009104) UART Line Control Register */
  __I  uint32_t STAT;                              /* !< (@ 0x00009108) UART Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000910C) UART Interrupt FIFO Level Select Register */
  __IO uint32_t IBRD;                              /* !< (@ 0x00009110) UART Integer Baud-Rate Divisor Register */
  __IO uint32_t FBRD;                              /* !< (@ 0x00009114) UART Fractional Baud-Rate Divisor Register */
       uint32_t RESERVED0[2];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00009120) UART Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00009124) UART Receive Data Register */
       uint32_t RESERVED1[2];
  __IO uint32_t LINCNT;                            /* !< (@ 0x00009130) UART LIN Mode Counter Register */
  __IO uint32_t LINCTL;                            /* !< (@ 0x00009134) UART LIN Mode Control Register */
  __IO uint32_t LINC0;                             /* !< (@ 0x00009138) UART LIN Mode Capture 0 Register */
  __IO uint32_t LINC1;                             /* !< (@ 0x0000913C) UART LIN Mode Capture 1 Register */
  __IO uint32_t IRCTL;                             /* !< (@ 0x00009140) eUSCI_Ax IrDA Control Word Register */
       uint32_t RESERVED2;
  __IO uint32_t AMASK;                             /* !< (@ 0x00009148) Self Address Mask Register */
  __IO uint32_t ADDR;                              /* !< (@ 0x0000914C) Self Address Register */
} M33C1SPGSS1_UC4_UART_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC4_UART_IPSPECIFIC */

/** @addtogroup M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00009088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00009090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00009098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000090A0) Interrupt set */
} M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00009058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00009060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00009068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00009070) Interrupt set */
} M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00009020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00009028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00009030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00009038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00009040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00009048) Interrupt clear */
} M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS1_UC4_UART_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00009000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00009008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00009018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00009020) */
       uint32_t RESERVED3;
  M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00009050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS1_UC4_UART_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00009080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000090E4) Interrupt control register */
} M33C1SPGSS1_UC4_UART_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS1_UC4_UART_IPSTANDARD */

/** @addtogroup M33C1SPGSS1_FUPDATE
  @{
*/

typedef struct {
  union {
      __O  uint32_t U0_SCLK;                           /* !< FUPDATE version of P0 */
      __I  uint32_t U0_SCLK_STAT_IO0;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_PICO;                           /* !< FUPDATE version of P0 */
      __I  uint32_t U0_PICO_STAT_IO1;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_POCI;                           /* !< FUPDATE version of P0 */
      __I  uint32_t U0_POCI_STAT_IO2;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_CS0;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U0_CS0_STAT_IO3;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_CS1;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U0_CS1_STAT_IO4;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_CS2;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U0_CS2_STAT_IO5;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_CS3;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U0_CS3_STAT_IO6;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_SCL;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U2_SCL_STAT_IO7;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_SDA;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U2_SDA_STAT_IO8;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U3_SCL;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U3_SCL_STAT_IO9;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U3_SDA;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U3_SDA_STAT_IO10;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U4_RX;                             /* !< FUPDATE version of P0 */
      __I  uint32_t U4_RX_STAT_IO11;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U4_TX;                             /* !< FUPDATE version of P0 */
      __I  uint32_t U4_TX_STAT_IO12;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U4_RTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U4_RTS_STAT_IO13;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U4_CTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U4_CTS_STAT_IO14;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U5_SCLK_SCL_RX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U5_SCLK_SCL_RX_STAT_IO15;          /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U5_PICO_SDA_TX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U5_PICO_SDA_TX_STAT_IO16;          /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U5_POCI_RTS;                       /* !< FUPDATE version of P0 */
      __I  uint32_t U5_POCI_RTS_STAT_IO17;             /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U5_CS0_CTS;                        /* !< FUPDATE version of P0 */
      __I  uint32_t U5_CS0_CTS_STAT_IO18;              /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
} M33C1SPGSS1_FUPDATE_Regs;

/*@}*/ /* end of group M33C1SPGSS1_FUPDATE */

/** @addtogroup M33C1SPGSS1_PINCM
  @{
*/

