TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
typedef struct {
  __IO uint32_t U0_SCLK;                           /* !< (@ 0x00000004) P0 */
  __IO uint32_t U0_PICO;                           /* !< (@ 0x00000008) P0 */
  __IO uint32_t U0_POCI;                           /* !< (@ 0x0000000C) P0 */
  __IO uint32_t U0_CS0;                            /* !< (@ 0x00000010) P0 */
  __IO uint32_t U0_CS1;                            /* !< (@ 0x00000014) P0 */
  __IO uint32_t U0_CS2;                            /* !< (@ 0x00000018) P0 */
  __IO uint32_t U0_CS3;                            /* !< (@ 0x0000001C) P0 */
  __IO uint32_t U2_SCL;                            /* !< (@ 0x00000020) P0 */
  __IO uint32_t U2_SDA;                            /* !< (@ 0x00000024) P0 */
  __IO uint32_t U3_SCL;                            /* !< (@ 0x00000028) P0 */
  __IO uint32_t U3_SDA;                            /* !< (@ 0x0000002C) P0 */
  __IO uint32_t U4_RX;                             /* !< (@ 0x00000030) P0 */
  __IO uint32_t U4_TX;                             /* !< (@ 0x00000034) P0 */
  __IO uint32_t U4_RTS;                            /* !< (@ 0x00000038) P0 */
  __IO uint32_t U4_CTS;                            /* !< (@ 0x0000003C) P0 */
  __IO uint32_t U5_SCLK_SCL_RX;                    /* !< (@ 0x00000040) P0 */
  __IO uint32_t U5_PICO_SDA_TX;                    /* !< (@ 0x00000044) P0 */
  __IO uint32_t U5_POCI_RTS;                       /* !< (@ 0x00000048) P0 */
  __IO uint32_t U5_CS0_CTS;                        /* !< (@ 0x0000004C) P0 */
} M33C1SPGSS1_PINCM_Regs;

/*@}*/ /* end of group M33C1SPGSS1_PINCM */

/** @addtogroup M33C1SPGSS1
  @{
*/

typedef struct {
       uint32_t RESERVED0;
  M33C1SPGSS1_PINCM_Regs  PINCM;                             /* !< (@ 0x00000004) */
       uint32_t RESERVED1[109];
  M33C1SPGSS1_FUPDATE_Regs  FUPDATE;                           /* !< (@ 0x00000204) */
       uint32_t RESERVED2[9068];
  M33C1SPGSS1_UC4_UART_IPSTANDARD_Regs  UC4_UART_IPSTANDARD;               /* !< (@ 0x00009000) */
       uint32_t RESERVED3[6];
  M33C1SPGSS1_UC4_UART_IPSPECIFIC_Regs  UC4_UART_IPSPECIFIC;               /* !< (@ 0x00009100) */
       uint32_t RESERVED4[812];
  M33C1SPGSS1_UC4_UART_LMGMT_DFT_ATRT_Regs  UC4_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00009E00) */
       uint32_t RESERVED5[1151];
  M33C1SPGSS1_UC5_UART_IPSTANDARD_Regs  UC5_UART_IPSTANDARD;               /* !< (@ 0x0000B000) */
       uint32_t RESERVED6[6];
  M33C1SPGSS1_UC5_UART_IPSPECIFIC_Regs  UC5_UART_IPSPECIFIC;               /* !< (@ 0x0000B100) */
       uint32_t RESERVED7[812];
  M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_Regs  UC5_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x0000BE00) */
       uint32_t RESERVED8[25727];
  M33C1SPGSS1_UC2_I2CC_IPSTANDARD_Regs  UC2_I2CC_IPSTANDARD;               /* !< (@ 0x00025000) */
       uint32_t RESERVED9[6];
  M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_Regs  UC2_I2CC_IPSPECIFIC;               /* !< (@ 0x00025100) */
       uint32_t RESERVED10[809];
  M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_Regs  UC2_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00025E00) */
       uint32_t RESERVED11[1150];
  M33C1SPGSS1_UC3_I2CC_IPSTANDARD_Regs  UC3_I2CC_IPSTANDARD;               /* !< (@ 0x00027000) */
       uint32_t RESERVED12[6];
  M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_Regs  UC3_I2CC_IPSPECIFIC;               /* !< (@ 0x00027100) */
       uint32_t RESERVED13[809];
  M33C1SPGSS1_UC3_I2CC_LMGMT_DFT_ATRT_Regs  UC3_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00027E00) */
       uint32_t RESERVED14[3198];
  M33C1SPGSS1_UC5_I2CC_IPSTANDARD_Regs  UC5_I2CC_IPSTANDARD;               /* !< (@ 0x0002B000) */
       uint32_t RESERVED15[6];
  M33C1SPGSS1_UC5_I2CC_IPSPECIFIC_Regs  UC5_I2CC_IPSPECIFIC;               /* !< (@ 0x0002B100) */
       uint32_t RESERVED16[810];
  M33C1SPGSS1_UC5_I2CC_LMGMT_DFT_ATRT_Regs  UC5_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x0002BE00) */
       uint32_t RESERVED17[25727];
  M33C1SPGSS1_UC2_I2CT_IPSTANDARD_Regs  UC2_I2CT_IPSTANDARD;               /* !< (@ 0x00045000) */
       uint32_t RESERVED18[6];
  M33C1SPGSS1_UC2_I2CT_IPSPECIFIC_Regs  UC2_I2CT_IPSPECIFIC;               /* !< (@ 0x00045100) */
       uint32_t RESERVED19[809];
  M33C1SPGSS1_UC2_I2CT_LMGMT_DFT_ATRT_Regs  UC2_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00045E00) */
       uint32_t RESERVED20[1150];
  M33C1SPGSS1_UC3_I2CT_IPSTANDARD_Regs  UC3_I2CT_IPSTANDARD;               /* !< (@ 0x00047000) */
       uint32_t RESERVED21[6];
  M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_Regs  UC3_I2CT_IPSPECIFIC;               /* !< (@ 0x00047100) */
       uint32_t RESERVED22[809];
  M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_Regs  UC3_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00047E00) */
       uint32_t RESERVED23[3198];
  M33C1SPGSS1_UC5_I2CT_IPSTANDARD_Regs  UC5_I2CT_IPSTANDARD;               /* !< (@ 0x0004B000) */
       uint32_t RESERVED24[6];
  M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_Regs  UC5_I2CT_IPSPECIFIC;               /* !< (@ 0x0004B100) */
       uint32_t RESERVED25[810];
  M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_Regs  UC5_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x0004BE00) */
       uint32_t RESERVED26[21631];
  M33C1SPGSS1_UC0_SPI_IPSTANDARD_Regs  UC0_SPI_IPSTANDARD;                /* !< (@ 0x00061000) */
       uint32_t RESERVED27[6];
  M33C1SPGSS1_UC0_SPI_IPSPECIFIC_Regs  UC0_SPI_IPSPECIFIC;                /* !< (@ 0x00061100) */
       uint32_t RESERVED28[812];
  M33C1SPGSS1_UC0_SPI_LMGMT_DFT_ATRT_Regs  UC0_SPI_LMGMT_DFT_ATRT;            /* !< (@ 0x00061E00) */
       uint32_t RESERVED29[9343];
  M33C1SPGSS1_UC5_SPI_IPSTANDARD_Regs  UC5_SPI_IPSTANDARD;                /* !< (@ 0x0006B000) */
       uint32_t RESERVED30[6];
  M33C1SPGSS1_UC5_SPI_IPSPECIFIC_Regs  UC5_SPI_IPSPECIFIC;                /* !< (@ 0x0006B100) */
       uint32_t RESERVED31[812];
  M33C1SPGSS1_UC5_SPI_LMGMT_DFT_ATRT_Regs  UC5_SPI_LMGMT_DFT_ATRT;            /* !< (@ 0x0006BE00) */
       uint32_t RESERVED32[21119];
  M33C1SPGSS1_EXT_GPRCM_UC0_Regs  EXT_GPRCM_UC0;                     /* !< (@ 0x00080800) */
       uint32_t RESERVED33[4090];
  M33C1SPGSS1_EXT_GPRCM_UC2_Regs  EXT_GPRCM_UC2;                     /* !< (@ 0x00084800) */
       uint32_t RESERVED34[570];
  M33C1SPGSS1_UC2_IPSPECIFIC_Regs  UC2_IPSPECIFIC;                    /* !< (@ 0x00085100) */
       uint32_t RESERVED35[1471];
  M33C1SPGSS1_EXT_GPRCM_UC3_Regs  EXT_GPRCM_UC3;                     /* !< (@ 0x00086800) */
       uint32_t RESERVED36[570];
  M33C1SPGSS1_UC3_IPSPECIFIC_Regs  UC3_IPSPECIFIC;                    /* !< (@ 0x00087100) */
       uint32_t RESERVED37[1471];
  M33C1SPGSS1_EXT_GPRCM_UC4_Regs  EXT_GPRCM_UC4;                     /* !< (@ 0x00088800) */
       uint32_t RESERVED38[2042];
  M33C1SPGSS1_EXT_GPRCM_UC5_Regs  EXT_GPRCM_UC5;                     /* !< (@ 0x0008A800) */
       uint32_t RESERVED39[570];
  M33C1SPGSS1_UC5_IPSPECIFIC_Regs  UC5_IPSPECIFIC;                    /* !< (@ 0x0008B100) */
       uint32_t RESERVED40[21503];
  M33C1SPGSS1_SPGSS_IPSPECIFIC_Regs  SPGSS_IPSPECIFIC;                  /* !< (@ 0x000A0100) */
       uint32_t RESERVED41[655];
  M33C1SPGSS1_SPGSS_LMGMT_DFT_ATRT_Regs  SPGSS_LMGMT_DFT_ATRT;              /* !< (@ 0x000A0C00) */
} M33C1SPGSS1_Regs;

/*@}*/ /* end of group M33C1SPGSS1 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

