TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_LPBK0 Bits */
/* M33C1SPGSS1_LPBK0[CONTROLLER] Bits */
#define M33C1SPGSS1_LPBK0_CONTROLLER_OFS         (8)                             /* !< CONTROLLER Offset */
#define M33C1SPGSS1_LPBK0_CONTROLLER_MASK        ((uint32_t)0x00000F00U)         /* !< Select SPG controller for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG1        ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG2        ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG3        ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG4        ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG5        ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG6        ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG7        ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG8        ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG9        ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG10       ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG11       ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG12       ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG13       ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG14       ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG15       ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS1_LPBK0_CONTROLLER_SPG16       ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS1_LPBK0[EN] Bits */
#define M33C1SPGSS1_LPBK0_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS1_LPBK0_EN_MASK                ((uint32_t)0x00000001U)         /* !< Loopback  enable */
#define M33C1SPGSS1_LPBK0_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS1_LPBK0_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */
/* M33C1SPGSS1_LPBK0[PERIPHERAL] Bits */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_OFS         (12)                            /* !< PERIPHERAL Offset */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_MASK        ((uint32_t)0x0000F000U)         /* !< Select SPG peripheral for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG1        ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG2        ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG3        ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG4        ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG5        ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG6        ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG7        ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG8        ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG9        ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG10       ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG11       ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG12       ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG13       ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG14       ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG15       ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS1_LPBK0_PERIPHERAL_SPG16       ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */

/* M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE Bits */
/* M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE[SELECT] Bits */
#define M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE_SELECT_OFS (0)                             /* !< SELECT Offset */
#define M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE_SELECT_MASK ((uint32_t)0x00000003U)         /* !< Free run control */
#define M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE_SELECT_UART ((uint32_t)0x00000000U)         /* !< Default functionality is UART */
#define M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE_SELECT_SPI ((uint32_t)0x00000001U)         /* !< SPG in SPI Mode */
#define M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE_SELECT_I2C_CONTROLLER ((uint32_t)0x00000002U)         /* !< SPG in I2C Controller Mode */
#define M33C1SPGSS1_UC5_IPSPECIFIC_IPMODE_SELECT_I2C_PERIPHERAL ((uint32_t)0x00000003U)         /* !< SPG in I2C Peripheral Mode */

/* M33C1SPGSS1_EXT_GPRCM_UC5_PWREN Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC5_PWREN[ENABLE] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Enable the power */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Power */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Power */
/* M33C1SPGSS1_EXT_GPRCM_UC5_PWREN[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_KEY_OFS  (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define M33C1SPGSS1_EXT_GPRCM_UC5_PWREN_KEY_UNLOCK_W ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL[RESETSTKYCLR] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETSTKYCLR_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETSTKYCLR_CLR ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL[RESETASSERT] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETASSERT_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_RESETASSERT_ASSERT ((uint32_t)0x00000001U)         /* !< Assert reset */
/* M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_KEY_MASK ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define M33C1SPGSS1_EXT_GPRCM_UC5_RSTCTL_KEY_UNLOCK_W ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_KEY_UNLOCK ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG[BLOCKASYNC] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define M33C1SPGSS1_EXT_GPRCM_UC5_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_STAT Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_STAT[RESETSTKY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_STAT_RESETSTKY_OFS (16)                            /* !< RESETSTKY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_STAT_RESETSTKY_NORES ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define M33C1SPGSS1_EXT_GPRCM_UC5_GPRCM_STAT_RESETSTKY_RESET ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* M33C1SPGSS1_EXT_GPRCM_UC4_PWREN Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC4_PWREN[ENABLE] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Enable the power */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Power */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Power */
/* M33C1SPGSS1_EXT_GPRCM_UC4_PWREN[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_KEY_OFS  (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define M33C1SPGSS1_EXT_GPRCM_UC4_PWREN_KEY_UNLOCK_W ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL[RESETSTKYCLR] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETSTKYCLR_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETSTKYCLR_CLR ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL[RESETASSERT] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETASSERT_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_RESETASSERT_ASSERT ((uint32_t)0x00000001U)         /* !< Assert reset */
/* M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_KEY_MASK ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define M33C1SPGSS1_EXT_GPRCM_UC4_RSTCTL_KEY_UNLOCK_W ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_KEY_UNLOCK ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG[BLOCKASYNC] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define M33C1SPGSS1_EXT_GPRCM_UC4_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_STAT Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_STAT[RESETSTKY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_STAT_RESETSTKY_OFS (16)                            /* !< RESETSTKY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_STAT_RESETSTKY_NORES ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define M33C1SPGSS1_EXT_GPRCM_UC4_GPRCM_STAT_RESETSTKY_RESET ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

