TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE Bits */
/* M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE[SELECT] Bits */
#define M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE_SELECT_OFS (0)                             /* !< SELECT Offset */
#define M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE_SELECT_MASK ((uint32_t)0x00000003U)         /* !< Free run control */
#define M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE_SELECT_UART ((uint32_t)0x00000000U)         /* !< Default functionality is UART */
#define M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE_SELECT_SPI ((uint32_t)0x00000001U)         /* !< SPG in SPI Mode */
#define M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE_SELECT_I2C_CONTROLLER ((uint32_t)0x00000002U)         /* !< SPG in I2C Controller Mode */
#define M33C1SPGSS1_UC3_IPSPECIFIC_IPMODE_SELECT_I2C_PERIPHERAL ((uint32_t)0x00000003U)         /* !< SPG in I2C Peripheral Mode */

/* M33C1SPGSS1_EXT_GPRCM_UC3_PWREN Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC3_PWREN[ENABLE] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Enable the power */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Power */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Power */
/* M33C1SPGSS1_EXT_GPRCM_UC3_PWREN[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_KEY_OFS  (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define M33C1SPGSS1_EXT_GPRCM_UC3_PWREN_KEY_UNLOCK_W ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL[RESETSTKYCLR] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETSTKYCLR_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETSTKYCLR_CLR ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL[RESETASSERT] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETASSERT_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_RESETASSERT_ASSERT ((uint32_t)0x00000001U)         /* !< Assert reset */
/* M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_KEY_MASK ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define M33C1SPGSS1_EXT_GPRCM_UC3_RSTCTL_KEY_UNLOCK_W ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_KEY_UNLOCK ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG[BLOCKASYNC] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define M33C1SPGSS1_EXT_GPRCM_UC3_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_STAT Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_STAT[RESETSTKY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_STAT_RESETSTKY_OFS (16)                            /* !< RESETSTKY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_STAT_RESETSTKY_NORES ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define M33C1SPGSS1_EXT_GPRCM_UC3_GPRCM_STAT_RESETSTKY_RESET ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE Bits */
/* M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE[SELECT] Bits */
#define M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE_SELECT_OFS (0)                             /* !< SELECT Offset */
#define M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE_SELECT_MASK ((uint32_t)0x00000003U)         /* !< Free run control */
#define M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE_SELECT_UART ((uint32_t)0x00000000U)         /* !< Default functionality is UART */
#define M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE_SELECT_SPI ((uint32_t)0x00000001U)         /* !< SPG in SPI Mode */
#define M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE_SELECT_I2C_CONTROLLER ((uint32_t)0x00000002U)         /* !< SPG in I2C Controller Mode */
#define M33C1SPGSS1_UC2_IPSPECIFIC_IPMODE_SELECT_I2C_PERIPHERAL ((uint32_t)0x00000003U)         /* !< SPG in I2C Peripheral Mode */

/* M33C1SPGSS1_EXT_GPRCM_UC2_PWREN Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC2_PWREN[ENABLE] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Enable the power */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Power */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Power */
/* M33C1SPGSS1_EXT_GPRCM_UC2_PWREN[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_KEY_OFS  (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define M33C1SPGSS1_EXT_GPRCM_UC2_PWREN_KEY_UNLOCK_W ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL[RESETSTKYCLR] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETSTKYCLR_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETSTKYCLR_CLR ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL[RESETASSERT] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETASSERT_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_RESETASSERT_ASSERT ((uint32_t)0x00000001U)         /* !< Assert reset */
/* M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_KEY_MASK ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define M33C1SPGSS1_EXT_GPRCM_UC2_RSTCTL_KEY_UNLOCK_W ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG Bits */
/* M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG[KEY] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_KEY_UNLOCK ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG[BLOCKASYNC] Bits */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define M33C1SPGSS1_EXT_GPRCM_UC2_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)         /* !< Block async clock request */

