TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_MIS Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_MIS[TX] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_MASK ((uint32_t)0x00000020U)         /* !< Masked Transmit FIFO event */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_SET ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_ISET[TX] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_MASK ((uint32_t)0x00000020U)         /* !< Set Transmit FIFO event. */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt */

/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK[RX] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_RIS Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_RIS[RX] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event.This interrupt
                                                                                    is set if the selected Receive FIFO
                                                                                    level has been reached */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_SET ((uint32_t)0x00000004U)         /* !< Interrupt occurred */

/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_MIS Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_MIS[RX] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_SET ((uint32_t)0x00000004U)         /* !< Interrupt occurred */

/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_ISET Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_ISET[RX] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_MASK ((uint32_t)0x00000004U)         /* !< Set Receive FIFO event. */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt */

/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_PER_EVT ((uint32_t)0x00000001U)         /* !< Transmit Parity Event/interrupt
                                                                                    pending */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_RXFIFO_OFV_EVT ((uint32_t)0x00000002U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_RX_EVT ((uint32_t)0x00000003U)         /* !< Receive interrupt */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_RXFULL_EVT ((uint32_t)0x00000004U)         /* !< RX FIFO Full Interrupt */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_TXFIFO_UNF_EVT ((uint32_t)0x00000005U)         /* !< TX FIFO underflow interrupt */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_TX_EVT ((uint32_t)0x00000006U)         /* !< Transmit Event */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_TX_EMPTY ((uint32_t)0x00000007U)         /* !< Transmit Buffer Empty
                                                                                    Event/interrupt pending */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_IDLE_EVT ((uint32_t)0x00000009U)         /* !< End of Transmit Event/interrupt
                                                                                    pending */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_RTOUT_EVT ((uint32_t)0x0000000AU)         /* !< SPI receive time-out interrupt */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ RX INTERRUPT */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ TX INTERRUPT */
#define M33C1SPGSS1_UC5_SPI_IPSTANDARD_IIDX_STAT_LTOUT ((uint32_t)0x00000015U)         /* !< SPI line time-out interrupt */

