TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< Transmit Data When read, last
                                                                                    written value will be returned. If
                                                                                    the last write to this field was a
                                                                                    32-bit write (with PACKEN=1), 32-bits
                                                                                    will be returned and if the last
                                                                                    write was a 16-bit write (PACKEN=0),
                                                                                    those 16-bits will be returned.
                                                                                    When written, one or two FIFO entries
                                                                                    will be written depending on PACKEN
                                                                                    value. Data values are removed from
                                                                                    the transmit FIFO one value at a time
                                                                                    by the transmit logic. It is loaded
                                                                                    into the transmit serial shifter,
                                                                                    then serially shifted out onto the
                                                                                    TXD output pin at the programmed bit
                                                                                    rate.  When a data size of less than
                                                                                    16 bits is selected, the user must
                                                                                    right-justify data written to the
                                                                                    transmit FIFO. The transmit logic
                                                                                    ignores the unused bits. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< Received Data When PACKEN=1,two
                                                                                    entries of the FIFO are returned as a
                                                                                    32-bit value. When PACKEN=0, 1 entry
                                                                                    of FIFO is returned as 16-bit value.
                                                                                    As data values are removed by the
                                                                                    receive logic from the incoming data
                                                                                    frame, they are placed into the entry
                                                                                    in the receive FIFO, pointed to by
                                                                                    the current FIFO write pointer.
                                                                                    Received data less than 16 bits is
                                                                                    automatically right justified in the
                                                                                    receive buffer. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1 Bits */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[LBM] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_LBM_OFS (1)                             /* !< LBM Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_LBM_MASK ((uint32_t)0x00000002U)         /* !< Loop back mode */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_LBM_DISABLE ((uint32_t)0x00000000U)         /* !< Disable loopback mode */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_LBM_ENABLE ((uint32_t)0x00000002U)         /* !< Enable loopback mode */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[CP] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CP_OFS (2)                             /* !< CP Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CP_MASK ((uint32_t)0x00000004U)         /* !< Controller or peripheral mode
                                                                                    select. This bit can be modified only
                                                                                    when SPI is disabled, CTL1.ENABLE=0. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CP_DISABLE ((uint32_t)0x00000000U)         /* !< Select Peripheral mode */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CP_ENABLE ((uint32_t)0x00000004U)         /* !< Select Controller Mode */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[POD] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_POD_OFS (3)                             /* !< POD Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_POD_MASK ((uint32_t)0x00000008U)         /* !< Peripheral-mode: Data output
                                                                                    disabled This bit is relevant only in
                                                                                    Peripheral mode. In
                                                                                    multiple-peripheral system
                                                                                    topologies, SPI controller can
                                                                                    broadcast a message to all
                                                                                    peripherals, while only one
                                                                                    peripheral drives the line.  POD can
                                                                                    be used by the SPI peripheral to
                                                                                    disable driving data on the line. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_POD_DISABLE ((uint32_t)0x00000000U)         /* !< SPI can drive the POCI output in
                                                                                    peripheral mode. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_POD_ENABLE ((uint32_t)0x00000008U)         /* !< SPI cannot drive the POCI output in
                                                                                    peripheral mode. */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[MSB] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_MSB_OFS (4)                             /* !< MSB Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_MSB_MASK ((uint32_t)0x00000010U)         /* !< MSB first select. Controls the
                                                                                    direction of the receive and transmit
                                                                                    shift register. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_MSB_DISABLE ((uint32_t)0x00000000U)         /* !< LSB first */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_MSB_ENABLE ((uint32_t)0x00000010U)         /* !< MSB first */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[PREN] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PREN_OFS (5)                             /* !< PREN Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PREN_MASK ((uint32_t)0x00000020U)         /* !< Parity receive enable If enabled,
                                                                                    parity reception check will be done
                                                                                    for both controller and peripheral
                                                                                    modes In case of a parity miss-match
                                                                                    the parity error flag RIS.PER will be
                                                                                    set. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PREN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Parity receive function */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PREN_ENABLE ((uint32_t)0x00000020U)         /* !< Enable Parity receive function */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[REPEATTX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_REPEATTX_OFS (16)                            /* !< REPEATTX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_REPEATTX_MASK ((uint32_t)0x00FF0000U)         /* !< Counter to repeat last transfer 0:
                                                                                    repeat last transfer is disabled. x:
                                                                                    repeat the last transfer with the
                                                                                    given number. The transfer will be
                                                                                    started with writing a data into the
                                                                                    TX Buffer. Sending the data will be
                                                                                    repeated with the given value, so the
                                                                                    data will be transferred X+1 times in
                                                                                    total. The behavior is identical as
                                                                                    if the data would be written into the
                                                                                    TX Buffer that many times as defined
                                                                                    by the value here. It can be used to
                                                                                    clean a transfer or to pull a certain
                                                                                    amount of data by a peripheral. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_REPEATTX_DISABLE ((uint32_t)0x00000000U)         /* !< REPEATTX disable */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_REPEATTX_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_REPEATTX_MAXIMUM ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[PES] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PES_OFS (6)                             /* !< PES Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PES_MASK ((uint32_t)0x00000040U)         /* !< Even Parity Select */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PES_DISABLE ((uint32_t)0x00000000U)         /* !< Odd Parity mode */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PES_ENABLE ((uint32_t)0x00000040U)         /* !< Even Parity mode */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[CDMODE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDMODE_OFS (12)                            /* !< CDMODE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDMODE_MASK ((uint32_t)0x0000F000U)         /* !< Command/Data Mode Value When
                                                                                    CTL1.CDENABLE is 1, CS3 line is used
                                                                                    as C/D signal to distinguish between
                                                                                    Command (C/D low) and Data (C/D high)
                                                                                    information. When a value is written
                                                                                    into the CTL1.CDMODE bits, the C/D
                                                                                    (CS3) line will go low for the given
                                                                                    numbers of byte which are sent by the
                                                                                    SPI, starting with the next value to
                                                                                    be transmitted after which, C/D line
                                                                                    will go high automatically 0: Manual
                                                                                    mode with C/D signal as High 1-14:
                                                                                    C/D is low while this number of bytes
                                                                                    are being sent after which, this
                                                                                    field sets to 0 and C/D goes high.
                                                                                    Reading this field at any time
                                                                                    returns the remaining number of
                                                                                    command bytes. 15: Manual mode with
                                                                                    C/D signal as Low. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDMODE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDMODE_DATA ((uint32_t)0x00000000U)         /* !< Manual mode: Data */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDMODE_MAXIMUM ((uint32_t)0x0000F000U)         /* !< Highest possible value */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDMODE_COMMAND ((uint32_t)0x0000F000U)         /* !< Manual mode: Command */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[ENABLE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< SPI enable */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable module function */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable module function */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[RXTIMEOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_RXTIMEOUT_OFS (24)                            /* !< RXTIMEOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_RXTIMEOUT_MASK ((uint32_t)0x3F000000U)         /* !< Receive Timeout (only for
                                                                                    Peripheral mode) Defines the number
                                                                                    of Clock Cycles before after which
                                                                                    the Receive Timeout flag RTOUT is
                                                                                    set. The time is calculated using the
                                                                                    control register for the clock
                                                                                    selection and divider in the
                                                                                    Controller mode configuration. A
                                                                                    value of 0 disables this function. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_RXTIMEOUT_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_RXTIMEOUT_MAXIMUM ((uint32_t)0x3F000000U)         /* !< Highest possible value */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[CDENABLE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDENABLE_OFS (11)                            /* !< CDENABLE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDENABLE_MASK ((uint32_t)0x00000800U)         /* !< Command/Data Mode enable */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< CS3 is used for Chip Select */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_CDENABLE_ENABLE ((uint32_t)0x00000800U)         /* !< CS3 is used as CD signal */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[PTEN] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PTEN_OFS (8)                             /* !< PTEN Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PTEN_MASK ((uint32_t)0x00000100U)         /* !< Parity transmit enable If enabled,
                                                                                    parity transmission will be done for
                                                                                    both controller and peripheral modes. */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PTEN_DISABLE ((uint32_t)0x00000000U)         /* !< Parity transmission is disabled */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_PTEN_ENABLE ((uint32_t)0x00000100U)         /* !< Parity transmission is enabled */
/* M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1[SUSPEND] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_OFS (9)                             /* !< SUSPEND Offset */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_MASK ((uint32_t)0x00000200U)         /* !< Suspend external communication */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS1_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_ENABLE ((uint32_t)0x00000200U)         /* !< External communication suspended */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO event: A read returns
                                                                                    the current mask for transmit FIFO
                                                                                    interrupt. On a write of 1, the mask
                                                                                    for transmit FIFO interrupt is set
                                                                                    which means the interrupt state will
                                                                                    be reflected in MIS.TXMIS. A write of
                                                                                    0 clears the mask which means
                                                                                    MIS.TXMIS will not reflect the
                                                                                    interrupt. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_SET ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

