TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_MASK ((uint32_t)0x00000020U)         /* !< Masked Transmit FIFO event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_SET ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_MASK ((uint32_t)0x00000020U)         /* !< Set Transmit FIFO event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event.This interrupt
                                                                                    is set if the selected Receive FIFO
                                                                                    level has been reached */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RX_SET ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out Event. This
                                                                                    bit is set when there is still
                                                                                    contents in the FIFO after the
                                                                                    timeout period */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RX_SET ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< SPI Receive Time-Out event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_MASK ((uint32_t)0x00000004U)         /* !< Set Receive FIFO event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< Set SPI Receive Time-Out event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

