TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_PER_EVT ((uint32_t)0x00000001U)         /* !< Transmit Parity Event/interrupt
                                                                                    pending */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_RXFIFO_OFV_EVT ((uint32_t)0x00000002U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_RX_EVT ((uint32_t)0x00000003U)         /* !< Receive interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_RXFULL_EVT ((uint32_t)0x00000004U)         /* !< RX FIFO Full Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_TXFIFO_UNF_EVT ((uint32_t)0x00000005U)         /* !< TX FIFO underflow interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_TX_EVT ((uint32_t)0x00000006U)         /* !< Transmit Event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_TX_EMPTY ((uint32_t)0x00000007U)         /* !< Transmit Buffer Empty
                                                                                    Event/interrupt pending */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_IDLE_EVT ((uint32_t)0x00000009U)         /* !< End of Transmit Event/interrupt
                                                                                    pending */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_RTOUT_EVT ((uint32_t)0x0000000AU)         /* !< SPI receive time-out interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ RX INTERRUPT */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ TX INTERRUPT */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_IIDX_STAT_LTOUT ((uint32_t)0x00000015U)         /* !< SPI line time-out interrupt */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RX_MASK ((uint32_t)0x00000004U)         /* !< Mask Receive Event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TX_MASK ((uint32_t)0x00000020U)         /* !< Mask Transmit Event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[TXEMPTY] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_OFS (6)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_MASK ((uint32_t)0x00000040U)         /* !< Transmit FIFO Empty event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_SET ((uint32_t)0x00000040U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[PER] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_PER_OFS (0)                             /* !< PER Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_PER_MASK ((uint32_t)0x00000001U)         /* !< Parity error event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_PER_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_PER_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[RXFIFO_OVF] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_OFS (1)                             /* !< RXFIFO_OVF Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_MASK ((uint32_t)0x00000002U)         /* !< RXFIFO overflow event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[IDLE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_OFS (8)                             /* !< IDLE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_MASK ((uint32_t)0x00000100U)         /* !< SPI Idle event mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< Enable SPI Receive Time-Out event
                                                                                    mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RTOUT_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[RXFULL] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_OFS (3)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_MASK ((uint32_t)0x00000008U)         /* !< RX FIFO Full Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[TXFIFO_UNF] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_OFS (4)                             /* !< TXFIFO_UNF Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_MASK ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Enable DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Enable DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK[LTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Enable SPI Line Time-Out event
                                                                                    mask. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_LTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_IMASK_LTOUT_SET ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

