TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RX_MASK ((uint32_t)0x00000004U)         /* !< Set Receive event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TX_MASK ((uint32_t)0x00000020U)         /* !< Set Transmit event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[TXEMPTY] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXEMPTY_OFS (6)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXEMPTY_MASK ((uint32_t)0x00000040U)         /* !< Set Transmit FIFO Empty event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXEMPTY_SET ((uint32_t)0x00000040U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[PER] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_PER_OFS (0)                             /* !< PER Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_PER_MASK ((uint32_t)0x00000001U)         /* !< Set Parity error event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_PER_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_PER_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[RXFIFO_OVF] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFIFO_OVF_OFS (1)                             /* !< RXFIFO_OVF Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFIFO_OVF_MASK ((uint32_t)0x00000002U)         /* !< Set RXFIFO overflow event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFIFO_OVF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFIFO_OVF_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[IDLE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_IDLE_OFS (8)                             /* !< IDLE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_IDLE_MASK ((uint32_t)0x00000100U)         /* !< Set SPI IDLE mode event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_IDLE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_IDLE_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< Set SPI Receive Time-Out Event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RTOUT_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[TXFIFO_UNF] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXFIFO_UNF_OFS (4)                             /* !< TXFIFO_UNF Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXFIFO_UNF_MASK ((uint32_t)0x00000010U)         /* !< Set TX FIFO Underflow Event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXFIFO_UNF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_TXFIFO_UNF_SET ((uint32_t)0x00000010U)         /* !< Set interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[RXFULL] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFULL_OFS (3)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFULL_MASK ((uint32_t)0x00000008U)         /* !< Set RX FIFO Full Event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_RXFULL_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Set DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Set DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET[LTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Set SPI Line Time-Out Event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CPU_INT_ISET_LTOUT_SET ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RX_MASK ((uint32_t)0x00000004U)         /* !< Clear Receive event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RX_CLR ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TX_MASK ((uint32_t)0x00000020U)         /* !< Clear Transmit event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TX_CLR ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[TXEMPTY] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXEMPTY_OFS (6)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXEMPTY_MASK ((uint32_t)0x00000040U)         /* !< Clear Transmit FIFO Empty event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXEMPTY_CLR ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[PER] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_PER_OFS (0)                             /* !< PER Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_PER_MASK ((uint32_t)0x00000001U)         /* !< Clear Parity error event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_PER_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_PER_CLR ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[RXFIFO_OVF] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFIFO_OVF_OFS (1)                             /* !< RXFIFO_OVF Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFIFO_OVF_MASK ((uint32_t)0x00000002U)         /* !< Clear RXFIFO overflow event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFIFO_OVF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFIFO_OVF_CLR ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[IDLE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_IDLE_OFS (8)                             /* !< IDLE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_IDLE_MASK ((uint32_t)0x00000100U)         /* !< Clear SPI IDLE mode event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_IDLE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_IDLE_CLR ((uint32_t)0x00000100U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[RTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RTOUT_OFS (9)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RTOUT_MASK ((uint32_t)0x00000200U)         /* !< Clear SPI Receive Time-Out Event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RTOUT_CLR ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[TXFIFO_UNF] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXFIFO_UNF_OFS (4)                             /* !< TXFIFO_UNF Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXFIFO_UNF_MASK ((uint32_t)0x00000010U)         /* !< Clear TXFIFO underflow event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXFIFO_UNF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_TXFIFO_UNF_CLR ((uint32_t)0x00000010U)         /* !< Clear interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[RXFULL] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFULL_OFS (3)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFULL_MASK ((uint32_t)0x00000008U)         /* !< Clear RX FIFO underflow event */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_RXFULL_CLR ((uint32_t)0x00000008U)         /* !< Clear interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_RX_CLR ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_DMA_DONE_TX_CLR ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR[LTOUT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Clear SPI Line Time-Out Event. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_ICLR_LTOUT_CLR ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects buscclk as clock source if
                                                                                    enabled */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS1_UC0_SPI_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS1_UC0_SPI_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS1_UC5_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

