TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR Bits */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[ENABLE] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Setting this bit enables the
                                                                                    module. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disables module operation. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enables module operation. */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[GENCALL] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_GENCALL_OFS (1)                             /* !< GENCALL Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_GENCALL_MASK ((uint32_t)0x00000002U)         /* !< General call response enable Modify
                                                                                    only when UCSWRST = 1. 0b = Do not
                                                                                    respond to a general call 1b =
                                                                                    Respond to a general call */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_GENCALL_DISABLE ((uint32_t)0x00000000U)         /* !< Do not respond to a general call */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_GENCALL_ENABLE ((uint32_t)0x00000002U)         /* !< Respond to a general call */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[CLKSTRETCH] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_OFS (20)                            /* !< CLKSTRETCH Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_MASK ((uint32_t)0x00100000U)         /* !< Clock Stretch Enable */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_DISABLE ((uint32_t)0x00000000U)         /* !< clock stretching is disabled */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_ENABLE ((uint32_t)0x00100000U)         /* !< clock stretching is enabled */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[TXEMPTY_ON_TREQ] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_OFS (3)                             /* !< TXEMPTY_ON_TREQ Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_MASK ((uint32_t)0x00000008U)         /* !< Tx Empty Interrupt on TREQ */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, RIS:TXEMPTY will be set
                                                                                    when only the Target TX FIFO is
                                                                                    empty. This allows the TXEMPTY
                                                                                    interrupt to be used to indicate that
                                                                                    the I2C bus is being clock stretched
                                                                                    and that Target TX data is required. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_ENABLE ((uint32_t)0x00000008U)         /* !< When 1, RIS:TXEMPTY will be set
                                                                                    when the Target State Machine is in
                                                                                    the TX_WAIT state which occurs when
                                                                                    the TX FIFO is empty AND the I2C
                                                                                    transaction is clock stretched
                                                                                    waiting for the FIFO to receive data. */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[TXTRIG_TXMODE] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_OFS (4)                             /* !< TXTRIG_TXMODE Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_MASK ((uint32_t)0x00000010U)         /* !< Tx Trigger when Target FSM is in Tx
                                                                                    Mode */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_ENABLE ((uint32_t)0x00000010U)         /* !< When 1, RIS:TXTRG will be set when
                                                                                    the Target TX FIFO has reached the
                                                                                    trigger level AND the Target State
                                                                                    Machine is in the TXMODE as defined
                                                                                    in the SSR register. When cleared
                                                                                    RIS:TXTRG will be set when the Target
                                                                                    TX FIFO is at or above the trigger
                                                                                    level. This setting can be used to
                                                                                    hold off the TX DMA until a
                                                                                    transaction starts. This allows the
                                                                                    DMA to be configured when the I2C is
                                                                                    idle but have it wait till the
                                                                                    transaction starts to load the Target
                                                                                    TX FIFO, so it can load from a memory
                                                                                    buffer that might be changing over
                                                                                    time. */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[TXWAIT_STALE_TXFIFO] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_OFS (5)                             /* !< TXWAIT_STALE_TXFIFO Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_MASK ((uint32_t)0x00000020U)         /* !< Tx transfer waits when stale data
                                                                                    in Tx FIFO. This prevents stale bytes
                                                                                    left in the TX FIFO from
                                                                                    automatically being sent on the next
                                                                                    I2C packet. Note: this should be used
                                                                                    with TXEMPTY_ON_TREQ set to prevent
                                                                                    the Target State Machine from waiting
                                                                                    for TX FIFO data without an interrupt
                                                                                    notification when the FIFO data is
                                                                                    stale. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, the TX FIFO empty signal to
                                                                                    the Target State Machine indicates
                                                                                    that the TX FIFO is empty. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_ENABLE ((uint32_t)0x00000020U)         /* !< When 1, the TX FIFO empty signal to
                                                                                    the Target State Machine will
                                                                                    indicate that the TX FIFO is empty or
                                                                                    that the TX FIFO data is stale. The
                                                                                    TX FIFO data is determined to be
                                                                                    stale when there is data in the TX
                                                                                    FIFO when the Target State Machine
                                                                                    leaves the TXMODE as defined in the
                                                                                    SSR register. This can occur is a
                                                                                    Stop or timeout occur when there are
                                                                                    bytes left in the TX FIFO. */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[RXFULL_ON_RREQ] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_OFS (6)                             /* !< RXFULL_ON_RREQ Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_MASK ((uint32_t)0x00000040U)         /* !< Rx full interrupt generated on RREQ
                                                                                    condition as indicated in SSR */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, RIS:SRXFULL will be set
                                                                                    when only the Target RX FIFO is full.
                                                                                    This allows the SRXFULL interrupt to
                                                                                    be used to indicate that the I2C bus
                                                                                    is being clock stretched and that the
                                                                                    FW must either read the RX FIFO or
                                                                                    ACK/NACK the current Rx byte. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_ENABLE ((uint32_t)0x00000040U)         /* !< When 1, RIS:SRXFULL will be set
                                                                                    when the Target State Machine is in
                                                                                    the RX_WAIT or RX_ACK_WAIT states
                                                                                    which occurs when the I2C transaction
                                                                                    is clock stretched because the RX
                                                                                    FIFO is full or the ACKOEN has been
                                                                                    set and the state machine is waiting
                                                                                    for FW to ACK/NACK the current byte. */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[WUEN] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_WUEN_OFS (21)                            /* !< WUEN Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_WUEN_MASK ((uint32_t)0x00200000U)         /* !< Target Wakeup Enable */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_WUEN_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, the Target is not allowed
                                                                                    to clock stretch on START detection */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_WUEN_ENABLE ((uint32_t)0x00200000U)         /* !< When 1, the Target is allowed to
                                                                                    clock stretch on START detection and
                                                                                    wait for faster clock to be
                                                                                    abvailable. This allows clean wake up
                                                                                    support for I2C in low power mode use
                                                                                    cases */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR[SUSPEND] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_SUSPEND_OFS (11)                            /* !< SUSPEND Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_SUSPEND_MASK ((uint32_t)0x00000800U)         /* !< Suspend external communication */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_CTR_SUSPEND_ENABLE ((uint32_t)0x00000800U)         /* !< External communication suspended */

/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL Bits */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL[ACKOEN] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_OFS (0)                             /* !< ACKOEN Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_MASK ((uint32_t)0x00000001U)         /* !< I2C Target ACK Override Enable
                                                                                    Read SR.ACKOEN to check current
                                                                                    status of this bit */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_DISABLE ((uint32_t)0x00000000U)         /* !< A response in not provided. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ENABLE ((uint32_t)0x00000001U)         /* !< An ACK or NACK is sent according to
                                                                                    the value written to the ACKOVAL bit. */
/* M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL[ACKOVAL] Bits */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_OFS (1)                             /* !< ACKOVAL Offset */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_MASK ((uint32_t)0x00000002U)         /* !< ACK Override Value Note: Override
                                                                                    control is not applicable to Address
                                                                                    frame. Bytes following address frame
                                                                                    can be acknowledged using ACKOVAL. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_DISABLE ((uint32_t)0x00000000U)         /* !< An ACK is sent indicating valid
                                                                                    data or command. */
#define M33C1SPGSS1_UC5_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_ENABLE ((uint32_t)0x00000002U)         /* !< A NACK is sent indicating invalid
                                                                                    data or command. */

