TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1 Bits */
/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1[SCL_TRIM_EN] Bits */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_OFS (0)                             /* !< SCL_TRIM_EN Offset */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_MASK ((uint32_t)0x00000001U)         /* !< Analog glitch filter trimming
                                                                                    enable for SCL */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SCL */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Trim for SCL */
/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1[SDA_TRIM_EN] Bits */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_OFS (1)                             /* !< SDA_TRIM_EN Offset */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_MASK ((uint32_t)0x00000002U)         /* !< Analog glitch filter trimming
                                                                                    enable for SDA */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SDA */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_ENABLE ((uint32_t)0x00000002U)         /* !< Enable Trim for SDA */
/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1[TRIM_SEL] Bits */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_OFS (2)                             /* !< TRIM_SEL Offset */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_MASK ((uint32_t)0x00000004U)         /* !< Select for which branch to trim */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_FALLING_EDGE ((uint32_t)0x00000000U)         /* !< Select Trim on falling edge */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_RISING_EDGE ((uint32_t)0x00000004U)         /* !< Select Trim on rising edge */
/* M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1[AGFTEST] Bits */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_AGFTEST_OFS (8)                             /* !< AGFTEST Offset */
#define M33C1SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1_AGFTEST_MASK ((uint32_t)0x00000100U)

/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[ENABLE] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Setting this bit enables the
                                                                                    module. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disables module operation. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enables module operation. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[GENCALL] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_GENCALL_OFS (1)                             /* !< GENCALL Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_GENCALL_MASK ((uint32_t)0x00000002U)         /* !< General call response enable Modify
                                                                                    only when UCSWRST = 1. 0b = Do not
                                                                                    respond to a general call 1b =
                                                                                    Respond to a general call */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_GENCALL_DISABLE ((uint32_t)0x00000000U)         /* !< Do not respond to a general call */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_GENCALL_ENABLE ((uint32_t)0x00000002U)         /* !< Respond to a general call */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[CLKSTRETCH] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_OFS (20)                            /* !< CLKSTRETCH Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_MASK ((uint32_t)0x00100000U)         /* !< Clock Stretch Enable */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_DISABLE ((uint32_t)0x00000000U)         /* !< clock stretching is disabled */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_CLKSTRETCH_ENABLE ((uint32_t)0x00100000U)         /* !< clock stretching is enabled */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[TXEMPTY_ON_TREQ] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_OFS (3)                             /* !< TXEMPTY_ON_TREQ Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_MASK ((uint32_t)0x00000008U)         /* !< Tx Empty Interrupt on TREQ */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, RIS:TXEMPTY will be set
                                                                                    when only the Target TX FIFO is
                                                                                    empty. This allows the TXEMPTY
                                                                                    interrupt to be used to indicate that
                                                                                    the I2C bus is being clock stretched
                                                                                    and that Target TX data is required. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXEMPTY_ON_TREQ_ENABLE ((uint32_t)0x00000008U)         /* !< When 1, RIS:TXEMPTY will be set
                                                                                    when the Target State Machine is in
                                                                                    the TX_WAIT state which occurs when
                                                                                    the TX FIFO is empty AND the I2C
                                                                                    transaction is clock stretched
                                                                                    waiting for the FIFO to receive data. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[TXTRIG_TXMODE] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_OFS (4)                             /* !< TXTRIG_TXMODE Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_MASK ((uint32_t)0x00000010U)         /* !< Tx Trigger when Target FSM is in Tx
                                                                                    Mode */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXTRIG_TXMODE_ENABLE ((uint32_t)0x00000010U)         /* !< When 1, RIS:TXTRG will be set when
                                                                                    the Target TX FIFO has reached the
                                                                                    trigger level AND the Target State
                                                                                    Machine is in the TXMODE as defined
                                                                                    in the SSR register. When cleared
                                                                                    RIS:TXTRG will be set when the Target
                                                                                    TX FIFO is at or above the trigger
                                                                                    level. This setting can be used to
                                                                                    hold off the TX DMA until a
                                                                                    transaction starts. This allows the
                                                                                    DMA to be configured when the I2C is
                                                                                    idle but have it wait till the
                                                                                    transaction starts to load the Target
                                                                                    TX FIFO, so it can load from a memory
                                                                                    buffer that might be changing over
                                                                                    time. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[TXWAIT_STALE_TXFIFO] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_OFS (5)                             /* !< TXWAIT_STALE_TXFIFO Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_MASK ((uint32_t)0x00000020U)         /* !< Tx transfer waits when stale data
                                                                                    in Tx FIFO. This prevents stale bytes
                                                                                    left in the TX FIFO from
                                                                                    automatically being sent on the next
                                                                                    I2C packet. Note: this should be used
                                                                                    with TXEMPTY_ON_TREQ set to prevent
                                                                                    the Target State Machine from waiting
                                                                                    for TX FIFO data without an interrupt
                                                                                    notification when the FIFO data is
                                                                                    stale. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, the TX FIFO empty signal to
                                                                                    the Target State Machine indicates
                                                                                    that the TX FIFO is empty. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_TXWAIT_STALE_TXFIFO_ENABLE ((uint32_t)0x00000020U)         /* !< When 1, the TX FIFO empty signal to
                                                                                    the Target State Machine will
                                                                                    indicate that the TX FIFO is empty or
                                                                                    that the TX FIFO data is stale. The
                                                                                    TX FIFO data is determined to be
                                                                                    stale when there is data in the TX
                                                                                    FIFO when the Target State Machine
                                                                                    leaves the TXMODE as defined in the
                                                                                    SSR register. This can occur is a
                                                                                    Stop or timeout occur when there are
                                                                                    bytes left in the TX FIFO. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[RXFULL_ON_RREQ] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_OFS (6)                             /* !< RXFULL_ON_RREQ Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_MASK ((uint32_t)0x00000040U)         /* !< Rx full interrupt generated on RREQ
                                                                                    condition as indicated in SSR */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, RIS:SRXFULL will be set
                                                                                    when only the Target RX FIFO is full.
                                                                                    This allows the SRXFULL interrupt to
                                                                                    be used to indicate that the I2C bus
                                                                                    is being clock stretched and that the
                                                                                    FW must either read the RX FIFO or
                                                                                    ACK/NACK the current Rx byte. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_RXFULL_ON_RREQ_ENABLE ((uint32_t)0x00000040U)         /* !< When 1, RIS:SRXFULL will be set
                                                                                    when the Target State Machine is in
                                                                                    the RX_WAIT or RX_ACK_WAIT states
                                                                                    which occurs when the I2C transaction
                                                                                    is clock stretched because the RX
                                                                                    FIFO is full or the ACKOEN has been
                                                                                    set and the state machine is waiting
                                                                                    for FW to ACK/NACK the current byte. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[EN_DEFHOSTADR] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFHOSTADR_OFS (7)                             /* !< EN_DEFHOSTADR Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFHOSTADR_MASK ((uint32_t)0x00000080U)         /* !< Enable Default Host Address */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFHOSTADR_DISABLE ((uint32_t)0x00000000U)         /* !< When this bit is 0, the default
                                                                                    host address is not matched NOTE: it
                                                                                    may still be matched if programmed
                                                                                    inside SOAR/SOAR2 */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFHOSTADR_ENABLE ((uint32_t)0x00000080U)         /* !< When this bit is 1, default host
                                                                                    address of 7h000_1000 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[EN_ALRESPADR] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_ALRESPADR_OFS (8)                             /* !< EN_ALRESPADR Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_ALRESPADR_MASK ((uint32_t)0x00000100U)         /* !< Enable Alert Response Address */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_ALRESPADR_DISABLE ((uint32_t)0x00000000U)         /* !< When this bit is 0, the alert
                                                                                    response address is not matched.
                                                                                    NOTE: it may still be matched if
                                                                                    programmed inside SOAR/SOAR2 */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_ALRESPADR_ENABLE ((uint32_t)0x00000100U)         /* !< When this bit is 1, alert response
                                                                                    address of 7h000_1100 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[EN_DEFDEVADR] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFDEVADR_OFS (9)                             /* !< EN_DEFDEVADR Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFDEVADR_MASK ((uint32_t)0x00000200U)         /* !< Enable Default device address */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFDEVADR_DISABLE ((uint32_t)0x00000000U)         /* !< When this bit is 0, the default
                                                                                    device address is not matched. NOTE:
                                                                                    it may still be matched if programmed
                                                                                    inside SOAR/SOAR2. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_EN_DEFDEVADR_ENABLE ((uint32_t)0x00000200U)         /* !< When this bit is 1, default device
                                                                                    address of 7h110_0001 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[WUEN] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_WUEN_OFS (21)                            /* !< WUEN Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_WUEN_MASK ((uint32_t)0x00200000U)         /* !< Target Wakeup Enable */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_WUEN_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, the Target is not allowed
                                                                                    to clock stretch on START detection */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_WUEN_ENABLE ((uint32_t)0x00200000U)         /* !< When 1, the Target is allowed to
                                                                                    clock stretch on START detection and
                                                                                    wait for faster clock to be
                                                                                    abvailable. This allows clean wake up
                                                                                    support for I2C in low power mode use
                                                                                    cases */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR[SUSPEND] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_SUSPEND_OFS (11)                            /* !< SUSPEND Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_SUSPEND_MASK ((uint32_t)0x00000800U)         /* !< Suspend external communication */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_CTR_SUSPEND_ENABLE ((uint32_t)0x00000800U)         /* !< External communication suspended */

