TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL[ACKOEN] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_OFS (0)                             /* !< ACKOEN Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_MASK ((uint32_t)0x00000001U)         /* !< I2C Target ACK Override Enable
                                                                                    Read SR.ACKOEN to check current
                                                                                    status of this bit */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_DISABLE ((uint32_t)0x00000000U)         /* !< A response in not provided. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ENABLE ((uint32_t)0x00000001U)         /* !< An ACK or NACK is sent according to
                                                                                    the value written to the ACKOVAL bit. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL[ACKOVAL] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_OFS (1)                             /* !< ACKOVAL Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_MASK ((uint32_t)0x00000002U)         /* !< ACK Override Value Note: Override
                                                                                    control is not applicable to Address
                                                                                    frame. Bytes following address frame
                                                                                    can be acknowledged using ACKOVAL. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_DISABLE ((uint32_t)0x00000000U)         /* !< An ACK is sent indicating valid
                                                                                    data or command. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOVAL_ENABLE ((uint32_t)0x00000002U)         /* !< A NACK is sent indicating invalid
                                                                                    data or command. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL[ACKOEN_ON_START] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_START_OFS (2)                             /* !< ACKOEN_ON_START Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_START_MASK ((uint32_t)0x00000004U)         /* !< When set this bit will
                                                                                    automatically enable target override
                                                                                    acknowlede following a Start
                                                                                    Condition. Status bit ACKOEN will
                                                                                    reflect a value of '1' when automatic
                                                                                    override enable is used. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_START_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_START_ENABLE ((uint32_t)0x00000004U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following a Start
                                                                                    Condition. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL[ACKOEN_ON_PECNEXT] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECNEXT_OFS (3)                             /* !< ACKOEN_ON_PECNEXT Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECNEXT_MASK ((uint32_t)0x00000008U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    acknowledge override following a
                                                                                    ACK/NACK of the byte received just
                                                                                    prior to the PEC byte. However,
                                                                                    setting ACKCTL.ACKOEN bit will not
                                                                                    automatically be ACKed/NACKed by the
                                                                                    State Machine and firmware must
                                                                                    perform this function by writing
                                                                                    Target.ACKCTL register. Status bit
                                                                                    ACKOEN will reflect a value of '1'
                                                                                    when automatic override enable is
                                                                                    used. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECNEXT_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECNEXT_ENABLE ((uint32_t)0x00000008U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the byte received just prior to
                                                                                    the PEC byte. Note that when ACKOEN
                                                                                    is set the PEC byte will not
                                                                                    automatically be ACKed/NACKed by the
                                                                                    State Machine and FW must perform
                                                                                    this function by writing
                                                                                    Target_SACKCTL. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL[ACKOEN_ON_PECDONE] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECDONE_OFS (4)                             /* !< ACKOEN_ON_PECDONE Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECDONE_MASK ((uint32_t)0x00000010U)         /* !< When set, this bit will
                                                                                    automatically turn on target
                                                                                    acknowledge enable field following
                                                                                    the ACK/NACK of the received PEC
                                                                                    byte. Status bit ACKOEN will reflect
                                                                                    a value of '1' when automatic
                                                                                    override enable is used. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECDONE_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_ACKCTL_ACKOEN_ON_PECDONE_ENABLE ((uint32_t)0x00000010U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the received PEC byte. */

