TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_GFCTL[AGFEN] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_GFCTL_AGFEN_OFS (8)                             /* !< AGFEN Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_GFCTL_AGFEN_MASK ((uint32_t)0x00000100U)         /* !< Analog Glitch Suppression Enable */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_GFCTL_AGFEN_DISABLE ((uint32_t)0x00000000U)         /* !< Analog Glitch Filter disable */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_GFCTL_AGFEN_ENABLE ((uint32_t)0x00000100U)         /* !< Analog Glitch Filter enable */

/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_TTXDATA Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_TTXDATA[DATA] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_TTXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_TTXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_TTXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_TTXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR[PECBYTECNT] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_OFS (0)                             /* !< PECBYTECNT Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_MASK ((uint32_t)0x000001FFU)         /* !< This is the current PEC Byte Count
                                                                                    of the State Machine. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_MAXIMUM ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR[PECSTS_CHECK] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_OFS (16)                            /* !< PECSTS_CHECK Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_MASK ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_SET ((uint32_t)0x00010000U)         /* !< Indicates PEC was checked in the
                                                                                    transaction that occurred before the
                                                                                    last Stop */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR[PECSTS_ERROR] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_OFS (17)                            /* !< PECSTS_ERROR Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_MASK ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_SET ((uint32_t)0x00020000U)         /* !< Indicates PEC check error occurred
                                                                                    in the transaction that occurred
                                                                                    before the last Stop */

/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2 Bits */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2[OAR2] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_OFS (0)                             /* !< OAR2 Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MASK ((uint32_t)0x0000007FU)         /* !< Own Address 2This field specifies
                                                                                    the alternate OAR2 address. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MAXIMUM ((uint32_t)0x0000007FU)         /* !< Highest possible value */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2[OAR2EN] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2EN_OFS (7)                             /* !< OAR2EN Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2EN_MASK ((uint32_t)0x00000080U)         /* !< Own Address 2 Enable */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2EN_DISABLE ((uint32_t)0x00000000U)         /* !< The alternate address is disabled. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2EN_ENABLE ((uint32_t)0x00000080U)         /* !< Enables the use of the alternate
                                                                                    address in the OAR2 field. */
/* M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2[OAR2_MASK] Bits */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MASK_OFS (16)                            /* !< OAR2_MASK Offset */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MASK_MASK ((uint32_t)0x007F0000U)         /* !< Own Address 2 Mask: This field
                                                                                    specifies bits A6 through A0 of the
                                                                                    Target address. The bits with value 1
                                                                                    in SOAR2.OAR2_MASK field will make
                                                                                    the corresponding incoming address
                                                                                    bits to match by default regardless
                                                                                    of the value inside SOAR2.OAR2 i.e.
                                                                                    corresponding SOAR2.OAR2 bit is a
                                                                                    dont care. */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MASK_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS1_UC3_I2CT_IPSPECIFIC_OAR2_OAR2_MASK_MAXIMUM ((uint32_t)0x007F0000U)         /* !< Maximum Value */

