TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS Bits */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[RXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Done Interrupt: Set after a
                                                                                    byte is received */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[TXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmission Done Interrupt: Set
                                                                                    after a byte is transmitted */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[GENCALL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_OFS (8)                             /* !< GENCALL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_MASK ((uint32_t)0x00000100U)         /* !< General Call Interrupt: set when a
                                                                                    general call is received */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[RXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, triggered as per IFLS
                                                                                    settings 				    when FIFO is not
                                                                                    present, this indicates when buffer
                                                                                    is full */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[TXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger     When FIFO is
                                                                                    present, triggered as per IFLS
                                                                                    settings
                                                                                    When FIFO is not present, trigger
                                                                                    when transmit buffer is empty */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[START] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_START_OFS (9)                             /* !< START Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_START_MASK ((uint32_t)0x00000200U)         /* !< Start Condition Interrupt: is set
                                                                                    after a START condition is received
                                                                                    and this target is addressed */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_START_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_START_SET ((uint32_t)0x00000200U)         /* !< Set when a START condition is
                                                                                    receivied and address matches
                                                                                    target's address */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[STOP] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_OFS (10)                            /* !< STOP Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_MASK ((uint32_t)0x00000400U)         /* !< Stop Condition Interrupt: set on a
                                                                                    STOP condition if this target was
                                                                                    being addressed */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_SET ((uint32_t)0x00000400U)         /* !< Interrupt is set when target is
                                                                                    addressed and STOP condition is
                                                                                    received */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set interrupt */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set interrupt */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[PEC_RX_ERR] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Interrupt ocuured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[TIMEOUTA] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[TIMEOUTB] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_SET ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[RXFULL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[TXEMPTY] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty Interrupt. This
                                                                                    interrupt is set if all data in the
                                                                                    Transmit FIFO have been shifted out
                                                                                    and FSM goes into idle mode. */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[TX_UNFL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_OFS (6)                             /* !< TX_UNFL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_MASK ((uint32_t)0x00000040U)         /* !< Transmit FIFO underflow */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_SET ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[RX_OVFL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_OFS (7)                             /* !< RX_OVFL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_MASK ((uint32_t)0x00000080U)         /* !< Receive FIFO overflow */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_SET ((uint32_t)0x00000080U)         /* !< Interrupt Occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS[ARBLOST] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_ARBLOST_OFS (17)                            /* !< ARBLOST Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_ARBLOST_MASK ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_RIS_ARBLOST_SET ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS Bits */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[GENCALL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_OFS (8)                             /* !< GENCALL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_MASK ((uint32_t)0x00000100U)         /* !< General Call Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[START] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_OFS (9)                             /* !< START Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_MASK ((uint32_t)0x00000200U)         /* !< START Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_SET ((uint32_t)0x00000200U)         /* !< Set MIS */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[STOP] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_OFS (10)                            /* !< STOP Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_MASK ((uint32_t)0x00000400U)         /* !< STOP Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_SET ((uint32_t)0x00000400U)         /* !< Set MIS */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set MIS */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set MIS */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[PEC_RX_ERR] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< Target RX Pec Error Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Set interrupt mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TIMEOUTA] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TIMEOUTB] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_SET ((uint32_t)0x00002000U)         /* !< Set interrupt mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RXFULL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TXEMPTY] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TX_UNFL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_OFS (6)                             /* !< TX_UNFL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_MASK ((uint32_t)0x00000040U)         /* !< Target TX FIFO underflow */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_SET ((uint32_t)0x00000040U)         /* !< Set interrupt mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RX_OVFL] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_OFS (7)                             /* !< RX_OVFL Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_MASK ((uint32_t)0x00000080U)         /* !< Target RX FIFO overflow */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_SET ((uint32_t)0x00000080U)         /* !< Set interrupt mask */
/* M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[ARBLOST] Bits */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_OFS (17)                            /* !< ARBLOST Offset */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_MASK ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_SET ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

