TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON[SCL] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SCL_OFS (0)                             /* !< SCL Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SCL_MASK ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SCL_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SCL_SET ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON[SDA] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SDA_OFS (1)                             /* !< SDA Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SDA_MASK ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SDA_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_BMON_SDA_SET ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR[PECBYTECNT] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_OFS (0)                             /* !< PECBYTECNT Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_MASK ((uint32_t)0x000001FFU)         /* !< PEC Byte Count	 This is the current
                                                                                    PEC Byte Count of the Controller
                                                                                    State Machine. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_MAXIMUM ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR[PECSTS_CHECK] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_OFS (16)                            /* !< PECSTS_CHECK Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_MASK ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_SET ((uint32_t)0x00010000U)         /* !< Indicates if the PEC was checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR[PECSTS_ERROR] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_OFS (17)                            /* !< PECSTS_ERROR Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_MASK ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_SET ((uint32_t)0x00020000U)         /* !< Indicates if a PEC check error
                                                                                    occurred in the transaction that
                                                                                    occurred before the last Stop */

/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA[DIR] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_DIR_OFS (0)                             /* !< DIR Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_DIR_MASK ((uint32_t)0x00000001U)         /* !< Receive/Send The DIR bit specifies
                                                                                    if the next operation is a Receive
                                                                                    (High) or Transmit (Low). 0h =
                                                                                    Transmit 1h = Receive */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_DIR_TRANSMIT ((uint32_t)0x00000000U)         /* !< in transmit mode. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_DIR_RECEIVE ((uint32_t)0x00000001U)         /* !< is in receive mode. */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA[ADDR] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_ADDR_OFS (1)                             /* !< ADDR Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_ADDR_MASK ((uint32_t)0x000007FEU)         /* !< I2C Target Address This field
                                                                                    specifies bits A9 through A0 of the
                                                                                    Target address. In 7-bit addressing
                                                                                    mode as selected by MSA.MODE bit, the
                                                                                    top 3 bits are don't care */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_ADDR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_ADDR_MAXIMUM ((uint32_t)0x000007FEU)         /* !< Highest possible value */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA[MODE] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_MODE_OFS (15)                            /* !< MODE Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_MODE_MASK ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used  When 0, 7-bit addressing
                                                                                    is used. When 1, 10-bit addressing is
                                                                                    used. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_MODE_MODE7 ((uint32_t)0x00000000U)         /* !< 7-bit addressing mode */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TA_MODE_MODE10 ((uint32_t)0x00008000U)         /* !< 10-bit addressing mode */

/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT[TCNTA] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_OFS (0)                             /* !< TCNTA Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT[TCNTB] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_OFS (16)                            /* !< TCNTB Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_MASK ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter B */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_MAXIMUM ((uint32_t)0x00FF0000U)         /* !< Highest possible value */

/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTLA] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_OFS (0)                             /* !< TCNTLA Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.  Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTAEN] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_OFS (15)                            /* !< TCNTAEN Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_MASK ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_ENABLE ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTLB] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_OFS (16)                            /* !< TCNTLB Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_MASK ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Load: Counter B is
                                                                                    used for SCL High Detection. This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit pre-load value for the Timeout
                                                                                    B count. NOTE: The value of CNTLB
                                                                                    must be greater than 1h.  Each count
                                                                                    is equal to 1* clock period. For
                                                                                    example, with 10MHz functional clock
                                                                                    one timeout period will be equal
                                                                                    to1*100ns. */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_MAXIMUM ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTBEN] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_OFS (31)                            /* !< TCNTBEN Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_MASK ((uint32_t)0x80000000U)         /* !< Timeout Counter B Enable */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS1_UC3_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_ENABLE ((uint32_t)0x80000000U)         /* !< Enable Timeout Counter B */

