TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock Division factor 0 : DIV_BY_1 1
                                                                                    : DIV_BY_2 .... 63: DIV_BY_64 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_61 ((uint32_t)0x0000003CU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_62 ((uint32_t)0x0000003DU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_63 ((uint32_t)0x0000003EU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_64 ((uint32_t)0x0000003FU)         /* !< Divide clock source by 8 */

/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS1_UC3_I2CC_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS1_UC3_I2CC_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1 Bits */
/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1[SCL_TRIM_EN] Bits */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_OFS (0)                             /* !< SCL_TRIM_EN Offset */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_MASK ((uint32_t)0x00000001U)         /* !< Analog glitch filter trimming
                                                                                    enable for SCL */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SCL */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Trim for SCL */
/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1[SDA_TRIM_EN] Bits */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_OFS (1)                             /* !< SDA_TRIM_EN Offset */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_MASK ((uint32_t)0x00000002U)         /* !< Analog glitch filter trimming
                                                                                    enable for SDA */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SDA */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_ENABLE ((uint32_t)0x00000002U)         /* !< Enable Trim for SDA */
/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1[TRIM_SEL] Bits */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_OFS (2)                             /* !< TRIM_SEL Offset */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_MASK ((uint32_t)0x00000004U)         /* !< Select for which branch to trim */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_FALLING_EDGE ((uint32_t)0x00000000U)         /* !< Select Trim on falling edge */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_RISING_EDGE ((uint32_t)0x00000004U)         /* !< Select Trim on rising edge */
/* M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1[AGFTEST] Bits */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_AGFTEST_OFS (8)                             /* !< AGFTEST Offset */
#define M33C1SPGSS1_UC2_I2CC_LMGMT_DFT_ATRT_TEST1_AGFTEST_MASK ((uint32_t)0x00000100U)

/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[FRM_START] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_OFS (0)                             /* !< FRM_START Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_MASK ((uint32_t)0x00000001U)         /* !< Start Transfer */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_DISABLE ((uint32_t)0x00000000U)         /* !< In standard mode, this encoding
                                                                                    means the Controller is unable to
                                                                                    transmit or receive data. */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_ENABLE ((uint32_t)0x00000001U)         /* !< The Controller is able to transmit
                                                                                    or receive data. See field decoding
                                                                                    in Table: MCTR Field decoding. */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[START] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_START_OFS (1)                             /* !< START Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_START_MASK ((uint32_t)0x00000002U)         /* !< Generate START */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_START_DISABLE ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the START condition. */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_START_ENABLE ((uint32_t)0x00000002U)         /* !< The controller generates the START
                                                                                    or repeated START condition. See
                                                                                    field decoding in Table: MCTR Field
                                                                                    decoding. */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[STOP] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_STOP_OFS (2)                             /* !< STOP Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_STOP_MASK ((uint32_t)0x00000004U)         /* !< Generate STOP */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_STOP_DISABLE ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the STOP condition. */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_STOP_ENABLE ((uint32_t)0x00000004U)         /* !< The controller generates the STOP
                                                                                    condition. See field decoding in
                                                                                    Table: MCTR Field decoding. */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[ACK] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACK_OFS (3)                             /* !< ACK Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACK_MASK ((uint32_t)0x00000008U)         /* !< Data Acknowledge Enable. Software
                                                                                    needs to configure this bit to send
                                                                                    the ACK or NACK. See field decoding
                                                                                    in Table: MCTR Field decoding. */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACK_DISABLE ((uint32_t)0x00000000U)         /* !< The last received data byte of a
                                                                                    transaction is not acknowledged
                                                                                    automatically . */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACK_ENABLE ((uint32_t)0x00000008U)         /* !< The last received data byte of a
                                                                                    transaction is acknowledged
                                                                                    automatically . */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[BLEN] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_BLEN_OFS (16)                            /* !< BLEN Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_BLEN_MASK ((uint32_t)0x0FFF0000U)         /* !< I2C transaction length This field
                                                                                    contains the programmed length of
                                                                                    bytes of the Transaction. */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_BLEN_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_BLEN_MAXIMUM ((uint32_t)0x0FFF0000U)         /* !< Highest possible value */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[ACKOEN] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_OFS (4)                             /* !< ACKOEN Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_MASK ((uint32_t)0x00000010U)         /* !< ACK overrride Enable */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_ENABLE ((uint32_t)0x00000010U)         /* !< When 1 and the Controller is
                                                                                    receiving data and the number of
                                                                                    bytes indicated in MBLEN have been
                                                                                    received, the state machine will
                                                                                    generate an rxdone interrupt and wait
                                                                                    at the start of the ACK for FW to
                                                                                    indicate if an ACK or NACK should be
                                                                                    sent. The ACK or NACK is selected by
                                                                                    writing the MCTR register and setting
                                                                                    ACK accordingly. The other fields in
                                                                                    this register can also be written at
                                                                                    this time to continue on with the
                                                                                    transaction. If a NACK is sent the
                                                                                    state machine will automatically send
                                                                                    a Stop. */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[RD_ON_TXEMPTY] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_OFS (5)                             /* !< RD_ON_TXEMPTY Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Read on TX Empty */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_ENABLE ((uint32_t)0x00000020U)         /* !< When 1 the Controller will transmit
                                                                                    all bytes from the TX FIFO before
                                                                                    continuing with the programmed Burst
                                                                                    Run Read. If the DIR is not set to
                                                                                    Read in the MSA then this bit is
                                                                                    ignored. The Start must be set in the
                                                                                    MCTR for proper I2C protocol. The
                                                                                    Controller will first send the Start
                                                                                    Condition, I2C Address with R/W bit
                                                                                    set to write, before sending the
                                                                                    bytes in the TX FIFO. When the TX
                                                                                    FIFO is empty, the I2C transaction
                                                                                    will continue as programmed in MTCR
                                                                                    and MSA without sending a Stop
                                                                                    Condition. This is intended to be
                                                                                    used to perform simple I2C command
                                                                                    based reads transition that will
                                                                                    complete after initiating them
                                                                                    without having to get an interrupt to
                                                                                    turn the bus around. */
/* M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR[SUSPEND] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_OFS (6)                             /* !< SUSPEND Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_MASK ((uint32_t)0x00000040U)         /* !< Suspend external communication */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS1_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_ENABLE ((uint32_t)0x00000040U)         /* !< External communication suspended */

