TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[RXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Done Interrupt:      RXDONE
                                                                                    interrupt is raised when a burst
                                                                                    length completes     Or, in case of
                                                                                    quick command, when a quick command
                                                                                    with R/Wn bit set to '1' */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[TIMEOUTA] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[NACK] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_OFS (7)                             /* !< NACK Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_MASK ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt: set
                                                                                    when address or data nack is received */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_SET ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[START] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_START_OFS (8)                             /* !< START Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_START_MASK ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_START_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_START_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[STOP] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_OFS (9)                             /* !< STOP Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_MASK ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[ARBLOST] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_OFS (10)                            /* !< ARBLOST Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_MASK ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt: in
                                                                                    multi-controller systems, when this
                                                                                    controller loses out during
                                                                                    arbitration */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[TXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Done Interrupt:
                                                                                    TXDONE interrupt is raised when a
                                                                                    burst length completes     Or, in
                                                                                    case of quick command, when a quick
                                                                                    command with R/Wn bit set to '0' */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[RXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, as per IFLS settings
                                                                                    when FIFO is not present, this
                                                                                    indicates when buffer is full */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[TXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger     When FIFO is
                                                                                    present, as per IFLS settings
                                                                                    When FIFO is not present, trigger
                                                                                    when transmit buffer is empty */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[PEC_RX_ERR] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< Receive PEC Error Interrupt: set
                                                                                    when the calculated PEC does not
                                                                                    match received PEC */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Interrupt Occured */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[TIMEOUTB] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTB_SET ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[RXFULL] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set when receive FIFO is full. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS[TXEMPTY] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty: set when
                                                                                    Transmit FIFO is empty */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[RXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[TIMEOUTA] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[NACK] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_NACK_OFS (7)                             /* !< NACK Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_NACK_MASK ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_NACK_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_NACK_SET ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[START] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_START_OFS (8)                             /* !< START Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_START_MASK ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_START_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_START_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[STOP] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_STOP_OFS (9)                             /* !< STOP Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_STOP_MASK ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_STOP_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[ARBLOST] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_ARBLOST_OFS (10)                            /* !< ARBLOST Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_ARBLOST_MASK ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_ARBLOST_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[TXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[RXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[TXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[PEC_RX_ERR] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Set interrupt mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[TIMEOUTB] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_SET ((uint32_t)0x00002000U)         /* !< Set interrupt mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[RXFULL] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< Masked RXFIFO full event */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS[TXEMPTY] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty masked
                                                                                    interrupt. This interrupt is set if
                                                                                    all data in the Transmit FIFO have
                                                                                    been shifted out and the transmit
                                                                                    goes into idle mode. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CPU_INT_MIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */

