TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[RXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXDONE_CLR ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[TIMEOUTA] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTA_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTA_CLR ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[NACK] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_NACK_OFS (7)                             /* !< NACK Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_NACK_MASK ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_NACK_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_NACK_CLR ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[START] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_START_OFS (8)                             /* !< START Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_START_MASK ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_START_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_START_CLR ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[STOP] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_STOP_OFS (9)                             /* !< STOP Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_STOP_MASK ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_STOP_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_STOP_CLR ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[ARBLOST] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_ARBLOST_OFS (10)                            /* !< ARBLOST Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_ARBLOST_MASK ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_ARBLOST_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_ARBLOST_CLR ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[TXDONE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXDONE_CLR ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[RXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXTRG_CLR ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[TXTRG] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit FIFO Trigger */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXTRG_CLR ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_TX_CLR ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_DMA_DONE_RX_CLR ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[PEC_RX_ERR] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_PEC_RX_ERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_PEC_RX_ERR_CLR ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[TIMEOUTB] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTB_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TIMEOUTB_CLR ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[RXFULL] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_RXFULL_CLR ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR[TXEMPTY] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_ICLR_TXEMPTY_CLR ((uint32_t)0x00000020U)         /* !< Clear Interrupt */

/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock Division factor 0 : DIV_BY_1 1
                                                                                    : DIV_BY_2 .... 63: DIV_BY_64 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_61 ((uint32_t)0x0000003CU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_62 ((uint32_t)0x0000003DU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_63 ((uint32_t)0x0000003EU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_64 ((uint32_t)0x0000003FU)         /* !< Divide clock source by 8 */

/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS1_UC2_I2CC_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS1_UC2_I2CC_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS1_UC5_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

