TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_LINC1 Bits */
/* M33C1SPGSS1_LINC1[DATA] Bits */
#define M33C1SPGSS1_LINC1_DATA_OFS               (0)                             /* !< DATA Offset */
#define M33C1SPGSS1_LINC1_DATA_MASK              ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    rising edge and can generate a LINC1
                                                                                    interrupt when capture is enabled
                                                                                    (LINC1CAP = 1) */
#define M33C1SPGSS1_LINC1_DATA_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_LINC1_DATA_MAXIMUM           ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS1_IRCTL Bits */
/* M33C1SPGSS1_IRCTL[IRTXPL] Bits */
#define M33C1SPGSS1_IRCTL_IRTXPL_OFS             (2)                             /* !< IRTXPL Offset */
#define M33C1SPGSS1_IRCTL_IRTXPL_MASK            ((uint32_t)0x000000FCU)         /* !< Transmit pulse length. Pulse length
                                                                                    t(PULSE) = (IRTXPLx + 1) / [2 *
                                                                                    f(IRTXCLK)] (IRTXCLK = functional
                                                                                    clock of the UART) */
#define M33C1SPGSS1_IRCTL_IRTXPL_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_IRCTL_IRTXPL_MAXIMUM         ((uint32_t)0x000000FCU)         /* !< Highest possible value */
/* M33C1SPGSS1_IRCTL[IRRXPL] Bits */
#define M33C1SPGSS1_IRCTL_IRRXPL_OFS             (9)                             /* !< IRRXPL Offset */
#define M33C1SPGSS1_IRCTL_IRRXPL_MASK            ((uint32_t)0x00000200U)         /* !< IrDA receive input UCAxRXD polarity */
#define M33C1SPGSS1_IRCTL_IRRXPL_HIGH            ((uint32_t)0x00000000U)         /* !< IrDA transceiver delivers a high
                                                                                    pulse when a light pulse is seen */
#define M33C1SPGSS1_IRCTL_IRRXPL_LOW             ((uint32_t)0x00000200U)         /* !< IrDA transceiver delivers a low
                                                                                    pulse when a light pulse is seen */
/* M33C1SPGSS1_IRCTL[IREN] Bits */
#define M33C1SPGSS1_IRCTL_IREN_OFS               (0)                             /* !< IREN Offset */
#define M33C1SPGSS1_IRCTL_IREN_MASK              ((uint32_t)0x00000001U)         /* !< IrDA encoder/decoder enable */
#define M33C1SPGSS1_IRCTL_IREN_DISABLE           ((uint32_t)0x00000000U)         /* !< IrDA encoder/decoder disabled */
#define M33C1SPGSS1_IRCTL_IREN_ENABLE            ((uint32_t)0x00000001U)         /* !< IrDA encoder/decoder enabled */
/* M33C1SPGSS1_IRCTL[IRTXCLK] Bits */
#define M33C1SPGSS1_IRCTL_IRTXCLK_OFS            (1)                             /* !< IRTXCLK Offset */
#define M33C1SPGSS1_IRCTL_IRTXCLK_MASK           ((uint32_t)0x00000002U)         /* !< IrDA transmit pulse clock select */
#define M33C1SPGSS1_IRCTL_IRTXCLK_BITCLK         ((uint32_t)0x00000000U)         /* !< IrDA encode data is based on the
                                                                                    functional clock. */
#define M33C1SPGSS1_IRCTL_IRTXCLK_BRCLK          ((uint32_t)0x00000002U)         /* !< IrDA encode data is based on the
                                                                                    Baud Rate clock< when select 8x
                                                                                    oversampling, the IRTXPL cycle should
                                                                                    less 8;  when select 16x
                                                                                    oversampling, the IRTXPL cycle should
                                                                                    less 16. */

/* M33C1SPGSS1_UC4_UART_IPSPECIFIC_AMASK Bits */
/* M33C1SPGSS1_UC4_UART_IPSPECIFIC_AMASK[VALUE] Bits */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_AMASK_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_AMASK_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_AMASK_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_AMASK_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS1_UC4_UART_IPSPECIFIC_ADDR Bits */
/* M33C1SPGSS1_UC4_UART_IPSPECIFIC_ADDR[VALUE] Bits */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_ADDR_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_ADDR_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_ADDR_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS1_UC4_UART_IPSPECIFIC_ADDR_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

