TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK Bits */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[FRMERR] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_OFS (1)                             /* !< FRMERR Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_MASK ((uint32_t)0x00000002U)         /* !< Enable UART Framing Error
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[PARERR] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_OFS (2)                             /* !< PARERR Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_MASK ((uint32_t)0x00000004U)         /* !< Enable UART Parity Error Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[BRKERR] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_OFS (3)                             /* !< BRKERR Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_MASK ((uint32_t)0x00000008U)         /* !< Enable UART Break Error Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[OVRERR] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_OFS (4)                             /* !< OVRERR Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_MASK ((uint32_t)0x00000010U)         /* !< Enable UART Receive Overrun Error
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[RXNE] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXNE_OFS (5)                             /* !< RXNE Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXNE_MASK ((uint32_t)0x00000020U)         /* !< Enable Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXNE_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXNE_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[RXPE] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXPE_OFS (6)                             /* !< RXPE Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXPE_MASK ((uint32_t)0x00000040U)         /* !< Enable Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXPE_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXPE_SET ((uint32_t)0x00000040U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[LINOVF] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINOVF_OFS (9)                             /* !< LINOVF Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINOVF_MASK ((uint32_t)0x00000200U)         /* !< Enable LIN Hardware Counter
                                                                                    Overflow Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINOVF_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINOVF_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[RXINT] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[TXINT] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[EOT] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_EOT_OFS (12)                            /* !< EOT Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_EOT_MASK ((uint32_t)0x00001000U)         /* !< Enable UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_EOT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_EOT_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[ADDR_MATCH] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_OFS (13)                            /* !< ADDR_MATCH Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Enable Address Match Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_SET ((uint32_t)0x00002000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[CTS] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_CTS_OFS (14)                            /* !< CTS Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_CTS_MASK ((uint32_t)0x00004000U)         /* !< Enable UART Clear to Send Modem
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_CTS_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_CTS_SET ((uint32_t)0x00004000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Enable DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Enable DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[RTOUT] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[LINC0] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC0_OFS (7)                             /* !< LINC0 Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC0_MASK ((uint32_t)0x00000080U)         /* !< Enable LIN Capture 0 / Match
                                                                                    Interrupt . */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC0_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC0_SET ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[LINC1] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC1_OFS (8)                             /* !< LINC1 Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC1_MASK ((uint32_t)0x00000100U)         /* !< Enable LIN Capture 1 Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC1_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LINC1_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[NERR] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_NERR_OFS (17)                            /* !< NERR Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_NERR_MASK ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_NERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_NERR_SET ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK[LTOUT] Bits */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Enable UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS1_UC4_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_SET ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

