TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_STAT_IO0 Bits */
/* M33C1SPGSS1_STAT_IO0[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO0_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO0_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO0[PAD] Bits */
#define M33C1SPGSS1_STAT_IO0_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO0_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U0_PICO Bits */
/* M33C1SPGSS1_FUPDATE_U0_PICO[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U0_PICO_IOADDR_OFS   (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U0_PICO_IOADDR_MASK  ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U0_PICO[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U0_PICO_LOCK_OFS     (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U0_PICO_LOCK_MASK    ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U0_PICO_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U0_PICO_LOCK_LOCK    ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U0_PICO[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U0_PICO_GSEL_OFS     (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U0_PICO_GSEL_MASK    ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U0_PICO_GSEL_PCHAN   ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U0_PICO_GSEL_GCHAN   ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO1 Bits */
/* M33C1SPGSS1_STAT_IO1[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO1_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO1_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO1[PAD] Bits */
#define M33C1SPGSS1_STAT_IO1_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO1_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U0_POCI Bits */
/* M33C1SPGSS1_FUPDATE_U0_POCI[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U0_POCI_IOADDR_OFS   (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U0_POCI_IOADDR_MASK  ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U0_POCI[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U0_POCI_LOCK_OFS     (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U0_POCI_LOCK_MASK    ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U0_POCI_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U0_POCI_LOCK_LOCK    ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U0_POCI[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U0_POCI_GSEL_OFS     (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U0_POCI_GSEL_MASK    ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U0_POCI_GSEL_PCHAN   ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U0_POCI_GSEL_GCHAN   ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO2 Bits */
/* M33C1SPGSS1_STAT_IO2[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO2_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO2_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO2[PAD] Bits */
#define M33C1SPGSS1_STAT_IO2_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO2_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U0_CS0 Bits */
/* M33C1SPGSS1_FUPDATE_U0_CS0[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS0_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS0_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U0_CS0[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS0_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS0_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U0_CS0_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U0_CS0_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U0_CS0[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS0_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS0_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U0_CS0_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U0_CS0_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO3 Bits */
/* M33C1SPGSS1_STAT_IO3[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO3_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO3_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO3[PAD] Bits */
#define M33C1SPGSS1_STAT_IO3_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO3_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U0_CS1 Bits */
/* M33C1SPGSS1_FUPDATE_U0_CS1[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS1_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS1_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U0_CS1[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS1_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS1_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U0_CS1_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U0_CS1_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U0_CS1[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS1_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS1_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U0_CS1_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U0_CS1_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

