TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_STAT_IO4 Bits */
/* M33C1SPGSS1_STAT_IO4[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO4_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO4_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO4[PAD] Bits */
#define M33C1SPGSS1_STAT_IO4_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO4_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U0_CS2 Bits */
/* M33C1SPGSS1_FUPDATE_U0_CS2[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS2_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS2_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U0_CS2[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS2_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS2_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U0_CS2_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U0_CS2_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U0_CS2[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS2_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS2_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U0_CS2_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U0_CS2_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO5 Bits */
/* M33C1SPGSS1_STAT_IO5[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO5_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO5_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO5[PAD] Bits */
#define M33C1SPGSS1_STAT_IO5_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO5_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U0_CS3 Bits */
/* M33C1SPGSS1_FUPDATE_U0_CS3[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS3_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS3_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U0_CS3[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS3_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS3_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U0_CS3_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U0_CS3_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U0_CS3[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U0_CS3_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U0_CS3_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U0_CS3_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U0_CS3_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO6 Bits */
/* M33C1SPGSS1_STAT_IO6[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO6_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO6_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO6[PAD] Bits */
#define M33C1SPGSS1_STAT_IO6_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO6_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U2_SCL Bits */
/* M33C1SPGSS1_FUPDATE_U2_SCL[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U2_SCL_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U2_SCL_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U2_SCL[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U2_SCL_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U2_SCL_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U2_SCL_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U2_SCL_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U2_SCL[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U2_SCL_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U2_SCL_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U2_SCL_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U2_SCL_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO7 Bits */
/* M33C1SPGSS1_STAT_IO7[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO7_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO7_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO7[PAD] Bits */
#define M33C1SPGSS1_STAT_IO7_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO7_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U2_SDA Bits */
/* M33C1SPGSS1_FUPDATE_U2_SDA[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U2_SDA_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U2_SDA_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U2_SDA[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U2_SDA_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U2_SDA_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U2_SDA_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U2_SDA_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U2_SDA[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U2_SDA_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U2_SDA_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U2_SDA_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U2_SDA_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

