TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_STAT_IO8 Bits */
/* M33C1SPGSS1_STAT_IO8[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO8_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO8_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO8[PAD] Bits */
#define M33C1SPGSS1_STAT_IO8_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO8_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U3_SCL Bits */
/* M33C1SPGSS1_FUPDATE_U3_SCL[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U3_SCL_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U3_SCL_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U3_SCL[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U3_SCL_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U3_SCL_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U3_SCL_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U3_SCL_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U3_SCL[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U3_SCL_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U3_SCL_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U3_SCL_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U3_SCL_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO9 Bits */
/* M33C1SPGSS1_STAT_IO9[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO9_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO9_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO9[PAD] Bits */
#define M33C1SPGSS1_STAT_IO9_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO9_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U3_SDA Bits */
/* M33C1SPGSS1_FUPDATE_U3_SDA[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U3_SDA_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U3_SDA_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U3_SDA[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U3_SDA_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U3_SDA_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U3_SDA_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U3_SDA_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U3_SDA[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U3_SDA_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U3_SDA_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U3_SDA_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U3_SDA_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO10 Bits */
/* M33C1SPGSS1_STAT_IO10[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO10_WAKEUP_OFS         (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO10_WAKEUP_MASK        ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO10[PAD] Bits */
#define M33C1SPGSS1_STAT_IO10_PAD_OFS            (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO10_PAD_MASK           ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

