TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_STAT_IO16 Bits */
/* M33C1SPGSS1_STAT_IO16[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO16_WAKEUP_OFS         (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO16_WAKEUP_MASK        ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO16[PAD] Bits */
#define M33C1SPGSS1_STAT_IO16_PAD_OFS            (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO16_PAD_MASK           ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U5_POCI_RTS Bits */
/* M33C1SPGSS1_FUPDATE_U5_POCI_RTS[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_IOADDR_OFS (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_IOADDR_MASK ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U5_POCI_RTS[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_LOCK_OFS (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_LOCK_MASK ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_LOCK_LOCK ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U5_POCI_RTS[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_GSEL_OFS (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_GSEL_MASK ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_GSEL_PCHAN ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U5_POCI_RTS_GSEL_GCHAN ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO17 Bits */
/* M33C1SPGSS1_STAT_IO17[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO17_WAKEUP_OFS         (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO17_WAKEUP_MASK        ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO17[PAD] Bits */
#define M33C1SPGSS1_STAT_IO17_PAD_OFS            (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO17_PAD_MASK           ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_FUPDATE_U5_CS0_CTS Bits */
/* M33C1SPGSS1_FUPDATE_U5_CS0_CTS[IOADDR] Bits */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_IOADDR_OFS (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_IOADDR_MASK ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS1_FUPDATE_U5_CS0_CTS[LOCK] Bits */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_LOCK_OFS  (1)                             /* !< LOCK Offset */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_LOCK_MASK ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_LOCK_LOCK ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS1_FUPDATE_U5_CS0_CTS[GSEL] Bits */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_GSEL_OFS  (0)                             /* !< GSEL Offset */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_GSEL_MASK ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_GSEL_PCHAN ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS1_FUPDATE_U5_CS0_CTS_GSEL_GCHAN ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS1_STAT_IO18 Bits */
/* M33C1SPGSS1_STAT_IO18[WAKEUP] Bits */
#define M33C1SPGSS1_STAT_IO18_WAKEUP_OFS         (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS1_STAT_IO18_WAKEUP_MASK        ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS1_STAT_IO18[PAD] Bits */
#define M33C1SPGSS1_STAT_IO18_PAD_OFS            (0)                             /* !< PAD Offset */
#define M33C1SPGSS1_STAT_IO18_PAD_MASK           ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS1_PINCM_U0_SCLK Bits */
/* M33C1SPGSS1_PINCM_U0_SCLK[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_PSTATE_OFS     (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_PSTATE_MASK    ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U0_SCLK_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U0_SCLK_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U0_SCLK_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U0_SCLK_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U0_SCLK[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_GSTATE_OFS     (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_GSTATE_MASK    ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U0_SCLK_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U0_SCLK_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U0_SCLK_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U0_SCLK_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U0_SCLK[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPD_OFS       (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPD_MASK      ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPD_PULL_DOWN ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U0_SCLK[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPU_OFS       (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPU_MASK      ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U0_SCLK_PIPU_PULL_UP   ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U0_SCLK[INENA] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_INENA_OFS      (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_INENA_MASK     ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U0_SCLK_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U0_SCLK_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U0_SCLK[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_HYSTEN_OFS     (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_HYSTEN_MASK    ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U0_SCLK_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U0_SCLK_HYSTEN_EN_HYST ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U0_SCLK[INV] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_INV_OFS        (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_INV_MASK       ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U0_SCLK_INV_NO_CHNG    ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U0_SCLK_INV_CHNG       ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U0_SCLK[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_WUEN_OFS       (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_WUEN_MASK      ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U0_SCLK_WUEN_NO_WAKEUP ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U0_SCLK_WUEN_WAKEUP    ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U0_SCLK[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_WCOMP_OFS      (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_WCOMP_MASK     ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U0_SCLK_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U0_SCLK_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U0_SCLK[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U0_SCLK_GFLT_OFS       (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U0_SCLK_GFLT_MASK      ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U0_SCLK_GFLT_DISABLE   ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U0_SCLK_GFLT_ENABLE    ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

/* M33C1SPGSS1_PINCM_U0_PICO Bits */
/* M33C1SPGSS1_PINCM_U0_PICO[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_PSTATE_OFS     (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_PSTATE_MASK    ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U0_PICO_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U0_PICO_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U0_PICO_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U0_PICO_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U0_PICO[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_GSTATE_OFS     (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_GSTATE_MASK    ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U0_PICO_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U0_PICO_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U0_PICO_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U0_PICO_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U0_PICO[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPD_OFS       (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPD_MASK      ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPD_PULL_DOWN ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U0_PICO[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPU_OFS       (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPU_MASK      ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U0_PICO_PIPU_PULL_UP   ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U0_PICO[INENA] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_INENA_OFS      (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_INENA_MASK     ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U0_PICO_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U0_PICO_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U0_PICO[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_HYSTEN_OFS     (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_HYSTEN_MASK    ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U0_PICO_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U0_PICO_HYSTEN_EN_HYST ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U0_PICO[INV] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_INV_OFS        (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_INV_MASK       ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U0_PICO_INV_NO_CHNG    ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U0_PICO_INV_CHNG       ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U0_PICO[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_WUEN_OFS       (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_WUEN_MASK      ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U0_PICO_WUEN_NO_WAKEUP ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U0_PICO_WUEN_WAKEUP    ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U0_PICO[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_WCOMP_OFS      (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_WCOMP_MASK     ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U0_PICO_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U0_PICO_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U0_PICO[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U0_PICO_GFLT_OFS       (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U0_PICO_GFLT_MASK      ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U0_PICO_GFLT_DISABLE   ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U0_PICO_GFLT_ENABLE    ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

