TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_PINCM_U3_SCL Bits */
/* M33C1SPGSS1_PINCM_U3_SCL[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_PSTATE_OFS      (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_PSTATE_MASK     ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U3_SCL_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U3_SCL_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U3_SCL_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U3_SCL_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U3_SCL[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_GSTATE_OFS      (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_GSTATE_MASK     ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U3_SCL_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U3_SCL_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U3_SCL_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U3_SCL_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U3_SCL[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPD_OFS        (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPD_MASK       ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPD_PULL_DOWN  ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U3_SCL[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPU_OFS        (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPU_MASK       ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U3_SCL_PIPU_PULL_UP    ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U3_SCL[INENA] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_INENA_OFS       (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_INENA_MASK      ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U3_SCL_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U3_SCL_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U3_SCL[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_HYSTEN_OFS      (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_HYSTEN_MASK     ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U3_SCL_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U3_SCL_HYSTEN_EN_HYST  ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U3_SCL[INV] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_INV_OFS         (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_INV_MASK        ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U3_SCL_INV_NO_CHNG     ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U3_SCL_INV_CHNG        ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U3_SCL[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_WUEN_OFS        (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_WUEN_MASK       ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U3_SCL_WUEN_NO_WAKEUP  ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U3_SCL_WUEN_WAKEUP     ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U3_SCL[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_WCOMP_OFS       (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_WCOMP_MASK      ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U3_SCL_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U3_SCL_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U3_SCL[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U3_SCL_GFLT_OFS        (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U3_SCL_GFLT_MASK       ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U3_SCL_GFLT_DISABLE    ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U3_SCL_GFLT_ENABLE     ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

/* M33C1SPGSS1_PINCM_U3_SDA Bits */
/* M33C1SPGSS1_PINCM_U3_SDA[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_PSTATE_OFS      (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_PSTATE_MASK     ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U3_SDA_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U3_SDA_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U3_SDA_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U3_SDA_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U3_SDA[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_GSTATE_OFS      (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_GSTATE_MASK     ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U3_SDA_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U3_SDA_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U3_SDA_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U3_SDA_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U3_SDA[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPD_OFS        (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPD_MASK       ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPD_PULL_DOWN  ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U3_SDA[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPU_OFS        (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPU_MASK       ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U3_SDA_PIPU_PULL_UP    ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U3_SDA[INENA] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_INENA_OFS       (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_INENA_MASK      ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U3_SDA_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U3_SDA_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U3_SDA[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_HYSTEN_OFS      (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_HYSTEN_MASK     ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U3_SDA_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U3_SDA_HYSTEN_EN_HYST  ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U3_SDA[INV] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_INV_OFS         (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_INV_MASK        ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U3_SDA_INV_NO_CHNG     ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U3_SDA_INV_CHNG        ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U3_SDA[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_WUEN_OFS        (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_WUEN_MASK       ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U3_SDA_WUEN_NO_WAKEUP  ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U3_SDA_WUEN_WAKEUP     ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U3_SDA[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_WCOMP_OFS       (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_WCOMP_MASK      ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U3_SDA_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U3_SDA_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U3_SDA[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U3_SDA_GFLT_OFS        (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U3_SDA_GFLT_MASK       ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U3_SDA_GFLT_DISABLE    ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U3_SDA_GFLT_ENABLE     ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

/* M33C1SPGSS1_PINCM_U4_RX Bits */
/* M33C1SPGSS1_PINCM_U4_RX[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_PSTATE_OFS       (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U4_RX_PSTATE_MASK      ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U4_RX_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U4_RX_PSTATE_HANDOVER  ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U4_RX_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U4_RX_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U4_RX[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_GSTATE_OFS       (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U4_RX_GSTATE_MASK      ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U4_RX_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U4_RX_GSTATE_HANDOVER  ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U4_RX_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U4_RX_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U4_RX[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_PIPD_OFS         (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U4_RX_PIPD_MASK        ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U4_RX_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U4_RX_PIPD_PULL_DOWN   ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U4_RX[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_PIPU_OFS         (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U4_RX_PIPU_MASK        ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U4_RX_PIPU_NO_PULL_UP  ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U4_RX_PIPU_PULL_UP     ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U4_RX[INENA] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_INENA_OFS        (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U4_RX_INENA_MASK       ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U4_RX_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U4_RX_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U4_RX[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_HYSTEN_OFS       (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U4_RX_HYSTEN_MASK      ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U4_RX_HYSTEN_DIS_HYST  ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U4_RX_HYSTEN_EN_HYST   ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U4_RX[INV] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_INV_OFS          (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U4_RX_INV_MASK         ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U4_RX_INV_NO_CHNG      ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U4_RX_INV_CHNG         ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U4_RX[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_WUEN_OFS         (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U4_RX_WUEN_MASK        ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U4_RX_WUEN_NO_WAKEUP   ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U4_RX_WUEN_WAKEUP      ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U4_RX[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_WCOMP_OFS        (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U4_RX_WCOMP_MASK       ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U4_RX_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U4_RX_WCOMP_MATCH_ONE  ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U4_RX[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U4_RX_GFLT_OFS         (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U4_RX_GFLT_MASK        ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U4_RX_GFLT_DISABLE     ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U4_RX_GFLT_ENABLE      ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

