TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss1.h
/* M33C1SPGSS1_PINCM_U5_POCI_RTS Bits */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PSTATE_OFS (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PSTATE_MASK ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GSTATE_OFS (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GSTATE_MASK ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPD_OFS   (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPD_MASK  ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPD_PULL_DOWN ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPU_OFS   (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPU_MASK  ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_PIPU_PULL_UP ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[INENA] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INENA_OFS  (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INENA_MASK ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_HYSTEN_OFS (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_HYSTEN_MASK ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_HYSTEN_EN_HYST ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[INV] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INV_OFS    (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INV_MASK   ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INV_NO_CHNG ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_INV_CHNG   ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WUEN_OFS   (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WUEN_MASK  ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WUEN_NO_WAKEUP ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WUEN_WAKEUP ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WCOMP_OFS  (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WCOMP_MASK ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U5_POCI_RTS[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GFLT_OFS   (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GFLT_MASK  ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GFLT_DISABLE ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U5_POCI_RTS_GFLT_ENABLE ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

/* M33C1SPGSS1_PINCM_U5_CS0_CTS Bits */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[PSTATE] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PSTATE_OFS  (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PSTATE_MASK ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[GSTATE] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GSTATE_OFS  (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GSTATE_MASK ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[PIPD] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPD_OFS    (16)                            /* !< PIPD Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPD_MASK   ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPD_PULL_DOWN ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[PIPU] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPU_OFS    (17)                            /* !< PIPU Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPU_MASK   ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_PIPU_PULL_UP ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[INENA] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INENA_OFS   (18)                            /* !< INENA Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INENA_MASK  ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[HYSTEN] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_HYSTEN_OFS  (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_HYSTEN_MASK ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_HYSTEN_EN_HYST ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[INV] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INV_OFS     (26)                            /* !< INV Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INV_MASK    ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INV_NO_CHNG ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_INV_CHNG    ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[WUEN] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WUEN_OFS    (27)                            /* !< WUEN Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WUEN_MASK   ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WUEN_NO_WAKEUP ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WUEN_WAKEUP ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[WCOMP] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WCOMP_OFS   (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WCOMP_MASK  ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS1_PINCM_U5_CS0_CTS[GFLT] Bits */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GFLT_OFS    (30)                            /* !< GFLT Offset */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GFLT_MASK   ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GFLT_DISABLE ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS1_PINCM_U5_CS0_CTS_GFLT_ENABLE ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_spgss1__include */

